; TCIMG3264_8_5.ini
[ Собрал Составил Изменил... Аверин Андрей Averin-And@yandex.ru]
[ TCIMG 34.7  от 04.08.2024 специально для Total Commander Image]
[ Сайт поддержки http://tc-image.3dn.ru https://t.me/tcimg]
[ Версия файла 2.7 от 02.11.2016 для Total Commander 8.51]
; [TOTALCOM32] - Классы, контролы, инстанции окон Total Commander 32 bit
[TOTALCOM32]
; -= ОСНОВНОЕ ОКНО TOTAL COMMANDER =-
; класс окна
TOTAL=TTOTAL_CMD
; панель инструментов
TOTAL1=TButtonBar1
; кнопки дисков слева
TOTAL2=TDrivePanel2
; кнопки дисков справа
TOTAL3=TDrivePanel1
; выбор дисков слева
TOTAL4=TMyComboBox2
; выбор дисков справа
TOTAL5=TMyComboBox3
; строка состояния слева (для получении информации приходится перебирать эти классы)
TOTAL6=TMyPanel5,TMyPanel6,TMyPanel7
; строка состояния справа
TOTAL7=TMyPanel8,TMyPanel9,TMyPanel10
; Вкладки слева
TOTAL8=TMyTabControl1
; Вкладки справа
TOTAL9=TMyTabControl2
; Заголовок файловой панели слева
TOTAL10=TPathPanel1
; Заголовок файловой панели справа
TOTAL11=TPathPanel2
; Сепаратор
TOTAL12=TPanel1
; ListBox
TOTAL13=TMyListBox1
TOTAL14=TMyListBox2
TOTAL15=TMyListBox3
; 
TOTAL16=THeaderClick1
TOTAL17=THeaderClick2
; функциональные кнопки
TOTAL18=TMyPanel2

TOTAL19=TMyListBox1
TOTAL20=TMyListBox2
TOTAL21=TMyListBox3
TOTAL22=TMyListBox4
TOTAL23=TMyListBox5

; -= НАСТРОЙКА TOTAL COMMANDER =-
; класс окна настройки
TCSETTING=TDLGCONFIGALL
; -= НАСТРОЙКА: ВИД ОКНА =-
; Компоненты основного окна
; Панель инструментов
TCSVW1=TCheckBox16
; Кнопки дисков
TCSVW2=TCheckBox15
; Две панели кнопок дисков (над файловыми панелями)
TCSVW3=TCheckBox7
; Плоские
TCSVW4=TCheckBox8
; Окно выбора диска
TCSVW5=TCheckBox14
; Вкладки папок
TCSVW6=TCheckBox5
; Заголовок файловой панели (с текущим путём)
TCSVW7=TCheckBox13
; Цепочки навигации
TCSVW8=TCheckBox4
; Автоматически раскрывать при наведении указателя мыши
TCSVW9=TCheckBox3
; Кнопки для истории и избранных каталогов
TCSVW10=TCheckBox6
; Заголовки табуляторов
TCSVW11=TCheckBox12
; Строка состояния
TCSVW12=TCheckBox11
; Командная строка
TCSVW13=TCheckBox10
; Кнопки функциональных клавиш
TCSVW14=TCheckBox9
; Плоский интерфейс (к панели инструментов не относится)
TCSVW15=TCheckBox2
; Стиль XP/Vista/7 для фона (меню, панели инструментов и дисков)
TCSVW16=TCheckBox1
; OK
TCSVW17=TButton30
; Отмена
TCSVW18=TButton29
; Справка
TCSVW19=TButton27
; Применить
TCSVW20=TButton28

; -= НАСТРОЙКА: СОДЕРЖИМОЕ ПАНЕЛЕЙ =-
; Отображение файлов
; Показывать скрытые файлы (show hidden files)
TCSCP24=TCheckBox15
; Показывать системные файлы (Show system files)
TCSCP1=TCheckBox9
; Длинные имена файлов
TCSCP2=TCheckBox12
; Имена формата 8.3 - в нижнем регистре (как в Проводнике Win9x)
TCSCP3=TCheckBox14
; Показывать [..] также и в корневом каталоге диска
TCSCP4=TCheckBox13
; Показывать квадратные скобки [] вокруг имён папок
TCSCP5=TCheckBox11
; Ширина колонок в кратком режиме не более ... пикселей
TCSCP6=TCheckBox10
; окошко, где указываются пиксели
TCSCP7=TEdit1
; Метод сортировки
TCSCP8=TMyComboBox1
; Дерево
; Всегда загружать полное дерево каталогов
TCSCP9=TCheckBox2
; TCSCP10- Нажать Enter для открытия каталога в другой панели
TCSCP10=TCheckBox1
; Сортировка каталогов
; Всегда по имени
TCSCP11=TRadioButton2
; TCSCP12- Как файлов (также и по времени)
TCSCP12=TRadioButton1
; Всплывающие подсказки
; Над кнопками панели инструментов
TCSCP13=TCheckBox8
; Над кнопками дисков (метки дисков, для сетевых - путь)
TCSCP14=TCheckBox7
; Над именами файлов, не помещающимися в панели
TCSCP15=TCheckBox6
; Подсказки/комментарии в стиле Win32 (если доступно)
TCSCP16=TCheckBox5
; Комментарии из descript.ion/files.bbs
TCSCP17=TCheckBox4
; Комментарии из Проводника (OLE2)
TCSCP18=TCheckBox3
;[+] (Дополнительные данные по типам файлов)
TCSCP19=TButton1
; OK
TCSCP20=TButton31
; Отмена
TCSCP21=TButton30
; Справка
TCSCP22=TButton28
; Применить
TCSCP23=TButton29
; --------------------------------------
; Дополнительные данные по типам файлов
TCSCPDTF=TDlgCustomColors
; окно списка типов данных
TCSCPDTF1=TMyListBox1
; Добавить
TCSCPDTF2=TButton5
; Правка
TCSCPDTF3=TButton4
; Удалить
TCSCPDTF4=TButton3
; OK
TCSCPDTF5=TButton2
; Отмена
TCSCPDTF6=TButton1

; -= НАСТРОЙКА: ЗНАЧКИ =-
; Показ значков, связанных с типом файлов
; Все ассоциированные + EXE/LNK (медленно)
TCSIC1=TRadioButton1
; Все ассоциированные
TCSIC2=TRadioButton4
; Только стандартные
TCSIC3=TRadioButton3
; Не показывать значки
TCSIC4=TRadioButton2
; Если EXE/LNK не на дискетах
TCSIC5=TCheckBox8
;	TCSIC6 - Если EXE/LNK не в сети
TCSIC6=TCheckBox7
; Показывать специальные значки для обычных папок
TCSIC7=TCheckBox6
; Показывать специальные значки для виртуальных папок и сети
TCSIC8=TCheckBox5
; Показывать оверлейные значки (например, для ярлыков)
TCSIC9=TCheckBox4
; Размер
; 32x32 (изменение размера значков)
TCSIC10=Edit1
; показ иконки
TCSIC11=TOwnerdrawPanel1
; Значки в главном меню
; Показывать значки для команд в главном меню
TCSIC12=TCheckBox3
; TCSIC13Показывать значки с обрамлением в виде к
TCSIC13=TCheckBox2
; Показывать выбранные пункты в виде нажатых кнопок
TCSIC14=TCheckBox1
; 16x16 (выбор размера значков главного меню)
TCSIC15=TMyComboBox1
; OK
TCSIC16=TButton30
; Отмена
TCSIC17=TButton29
; Справка
TCSIC18=TButton27
; Применить
TCSIC19=TButton28

; -= НАСТРОЙКА: ШРИФТЫ =-
; Шрифт файловых панелей (Изменить шрифт )
TCSF1=TButton3
; Шрифт основного окна (Изменить шрифт )
TCSF2=TButton2
; Шрифт в диалоговых окнах (Изменить шрифт )
TCSF3=TButton1
; OK
TCSF4=TButton30
; Отмена
TCSF5=TButton29
; Справка
TCSF6=TButton27
; Применить
TCSF7=TButton28
; --------------------------------------------
; Диалог выбора шрифта для всех 3-х кнопок
; Выбор шрифта
TCSFFP1=Edit1
TCSFFP2=ComboLBox1
; Выбор начертания
TCSFFP3=Edit2
TCSFFP4=ComboLBox2
; Выбор размера
TCSFFP5=Edit3
TCSFFP6=ComboLBox3
; Образец
TCSFFP7=Button4
; Набор символов
TCSFFP8=ComboBox5
; OK
TCSFFP9=Button5
; Отмена
TCSFFP10=Button6

; -= НАСТРОЙКА: ЦВЕТА =-
; Текст
TCSCL1=TMyComboBox8
TCSCL2=TButton8
; Фон 1
TCSCL3=TMyComboBox7
TCSCL4=TButton7
; Фон 2
TCSCL5=TMyComboBox1
TCSCL6=TButton1
; Выделение
TCSCL7=TMyComboBox6
TCSCL8=TButton6
; Курсор
TCSCL9=TMyComboBox5
TCSCL10=TButton5
; Текст под курсором
TCSCL11=TMyComboBox4
TCSCL12=TButton4
; Другие:
; Просмотрщик (Lister):
TCSCL13=TMyComboBox2
TCSCL14=TMyComboBox3
TCSCL15=TButton2
; Инверсный курсор
TCSCL16=TCheckBox3
; Инверсное выделение
TCSCL17=TCheckBox1
; Определить цвета для типов файлов (галочка)
TCSCL18=TCheckBox2
; Определить цвета для типов файлов (кнопка)
TCSCL19=TButton3
; Образец
TCSCL20=TOwnerdrawPanel1
; OK
TCSCL21=TButton37
; Отмена
TCSCL22=TButton36
; Справка
TCSCL23=TButton34
; Применить
TCSCL24=TButton35
; -------------------------------------
; Диалог - Определить цвета для типов файлов
; окно списка цвета типов файлов
TCSCLTF1=TMyListBox1
; Добавить
TCSCLTF2=TButton5
; Правка
TCSCLTF3=TButton4
; Удалить
TCSCLTF4=TButton3
; ОК
TCSCLTF5=TButton2
; Отмена
TCSCLTF6=TButton1

; -= НАСТРОЙКА: ТАБУЛЯТОРЫ =-
; Показывать типы (расширения) файлов
; Сразу после имени
TCSTB1=TRadioButton2
; Выровненными (по Tab)
TCSTB2=TRadioButton1
; Позиции табуляторов
; Тип (расширение):
TCSTB3=TEdit2
TCSTB4=TScrollBar2
; Размер:
TCSTB5=TEdit5
TCSTB6=TScrollBar5
; Дата/время:
TCSTB7=TEdit4
TCSTB8=TScrollBar4
; Атрибуты:
TCSTB9=TEdit3
TCSTB10=TScrollBar3
; Комментарии:
TCSTB11=TEdit1
TCSTB12=TScrollBar1
; Выравнивать колонки по ширине панели
TCSTB13=TCheckBox2
; Показывать столетие в дате (20хх)
TCSTB14=TCheckBox4
;12-часовой формат времени (АМ/РМ)
TCSTB15=TCheckBox3
; Выводить внизу число папок
TCSTB16=TCheckBox1
; Размеры в панелях:	▼
TCSTB17=TMyComboBox2
; В строке состояния:	▼
TCSTB18=TMyComboBox1
; По умолчанию
TCSTB19=TButton1
; OK
TCSTB20=TButton30
; Отмена
TCSTB21=TButton29
; Справка
TCSTB22=TButton27
; Применить
TCSTB23=TButton28

; -= НАСТРОЙКА: ВКЛАДКИ ПАПОК =-
; Заголовки вкладок
; Показывать заголовок вкладки, даже если она одна
TCSTF1=TCheckBox4
; Размещать вкладки в несколько рядов
TCSTF2=TCheckBox11
; Все вкладки имеют одинаковую ширину
TCSTF3=TCheckBox10
; Ограничить размер заголовка до: ... символов
TCSTF4=TCheckBox9
; окно ввода количества символов
TCSTF5=TEdit1
; Подтверждать закрытие всех вкладок
TCSTF6=TCheckBox8
; Закрывать вкладку по двойному щелчку
TCSTF7=TCheckBox7
; Ctrl+вверх делает новую вкладку активной
TCSTF8=TCheckBox6
; Открывать новую вкладку рядом с текущей
TCSTF9=TCheckBox5
; Отмечать заблокированные вкладки звёздочкой *
TCSTF10=TCheckBox3
; Делать панель активной при щелчке по одной из её вкладок
TCSTF11=TCheckBox2
; Всегда показывать букву диска в заголовке вкладки
TCSTF12=TCheckBox1
; OK
TCSTF13=TButton30
; Отмена
TCSTF14=TButton29
; Справка
TCSTF15=TButton27
; Применить
TCSTF16=TButton28

; -= НАСТРОЙКА: НАБОРЫ КОЛОНОК =-
; Настройка колонок для FS-плагина < Общие наборы колонок >
TCSSC1=TMyComboBox1
; окно списка наборов
TCSSC2=TMyListBox2
; Новый
TCSSC3=TButton2
; Правка
TCSSC4=TButton4
; Удалить
TCSSC5=TButton3
; Копировать
TCSSC6=TButton1
; OK
TCSSC7=TButton30
; Отмена
TCSSC8=TButton29
; Справка
TCSSC9=TButton27
; Применить
TCSSC10=TButton28
; -----------------------------------------------------
; Диалог настройки набора колонок
; Класс окна настройки набора колонок
TCSSCSC=TCustomColumnForm
; Настройка набора номер
TCSSCSC1=TPanel2
; Имя:
TCSSCSC2=TAltEdit1
; Последняя  кнопка [+]
TCSSCSC3=TButton4
; Добавить колонку
TCSSCSC4=TButton7
; Удалить текущую колонку
TCSSCSC5=TButton8
; Выравнивать по ширине панели
TCSSCSC6=TCheckBox3
; Горизонтальная полоса прокрутки
TCSSCSC7=TCheckBox2
; OK
TCSSCSC8=TButton3
; Отмена
TCSSCSC9=TButton2
; Применить
TCSSCSC10=TButton1

; -= НАСТРОЙКА: ЯЗЫК (LANGUAGE) =-
; Окно списка языков
TCSLG1=TMyListBox2
; Окно файла главного меню
TCSLG2=TEdit1
; Кнопка выбора файла главного меню
TCSLG3=TButton3
; Правка
TCSLG4=TButton2
; Скачать
TCSLG5=TButton1
; OK
TCSLG6=TButton31
; Отмена
TCSLG7=TButton30
; Справка
TCSLG8=TButton28
; Применить
TCSLG9=TButton29

; -= НАСТРОЙКА: ОСНОВНЫЕ ОПЕРАЦИИ =-
; Главная копия программы
; Запрет одновременного запуска нескольких копий TotalCmd
TCSBO1=TCheckBox7
; Сворачивать в системный трей (рядом с часами)
TCSBO2=TCheckBox6
; При смене диска всегда переходить в корневой каталог
TCSBO3=TCheckBox5
; Выполнять запуск программ и открытие файлов одиночным...
TCSBO4=TCheckBox3
; При переименовании выделять только имя файла...
TCSBO5=TCheckBox4
; Автозавершение путей
TCSBO6=TCheckBox2
; Автоподстановка имён
TCSBO7=TCheckBox1
; Выделение мышью
; Правой кнопкой (как в NC. FAR); контекстное меню - через 1 с
TCSBO8=TRadioButton6
; Левой кнопкой (как принято в Windows)
TCSBO9=TRadioButton5
; Щелчком по значку
TCSBO28=TCheckBox19
; Только для сенсорных экранов
TCSBO29=TCheckBox18
; Выделять (по Num + и др.)
; Только файлы
TCSBO10=TRadioButton4
; Файлы и каталоги
TCSBO11=TRadioButton3
; Коррекция времени на NTFS
; Игнорировать разницу в 1 ч
TCSBO12=TCheckBox111
; Сохранять при выходе
; Состояние каталогов
TCSBO13=TCheckBox17
; Состояние (вид) панелей
TCSBO14=TCheckBox16
; Историю команд
TCSBO15=TCheckBox15
; Историю каталогов
TCSBO16=TCheckBox14
; Подсчитывать место, занимаемое подкаталогами
; При выделении ПРОБЕЛОМ
TCSBO17=TCheckBox13
; Перед копированием/удалением
TCSBO18=TCheckBox12
; Комментарии к файлам ; Предпочесть файл
; files.bbs
TCSBO19=TRadioButton1
; descript.ion
TCSBO20=TRadioButton2
; Кодировка DOS
TCSBO21=TCheckBox8
; Копировать комментарии с файл
TCSBO22=TCheckBox9
; Читать из обоих типов
TCSBO23=TCheckBox10
; OK
TCSBO24=TButton30
; Отмена
TCSBO25=TButton29
; Справка
TCSBO26=TButton27
; Применить
TCSBO27=TButton28

; -= НАСТРОЙКА: ПРАВКА/ПРОСМОТР =-
; Просмотр по F3
; Файл под курсором - внутренней программой
TCSEV1=TRadioButton3
; Выделенные файлы - внутренней программе
TCSEV2=TRadioButton2
; Внешней программой просмотра:
TCSEV3=TRadioButton1
; По типам файлов...
TCSEV4=TButton4
; по
TCSEV5=TEdit2
; [>>]
TCSEV6=TButton3
; Настройка программы просмотра
TCSEV7=TButton2
; Правка по F4
; Программа-Редактор:
TCSEV8=TEdit1
; [>>]
TCSEV9=TButton1
; FTP и WFX-плагины: Автозакачка редактируемых файлов
TCSEV14=TMyCheckBox1
; OK
TCSEV10=TButton32
; Отмена
TCSEV11=TButton31
; Справка
TCSEV12=TButton29
; Применить
TCSEV13=TButton30
;--------------------------------------
; Диалог файловые ассоциации (кнопка: По типам файлов...	)
; класс окна файловые ассоциации
TCSEVAS=TASSOCIATEDLG
;  список программ
TCSEVAS1=ComboLBox1
; открывать с помощью:
TCSEVAS2=Edit1
; окно выбора расширения
TCSEVAS3=Edit2
; кнопка в окне выбора расширения ▼
TCSEVAS4=TMyComboBox2
; Обзор...
TCSEVAS5=TButton3
; OK
TCSEVAS6=TButton5
; Отмена
TCSEVAS7=TButton4
; Справка
TCSEVAS8=TButton2
;--------------------------------------
; Диалог настройки внутренней программы просмотра (кнопка: Настройка программы просмотра)
; Класс диалога
TCSEVIV=TCSEVTLISTCONF
; Вид при запуске
; Текст
TCSEVIV1=TMyRadioButton8
; Двоичный
TCSEVIV2=TMyRadioButton7
; HEX
TCSEVIV3=TMyRadioButton6
; Автовыбор
TCSEVIV4=TMyRadioButton5
; Шрифт при запуске
; ANSI
TCSEVIV5=TMyRadioButton4
; ASCII
TCSEVIV6=TMyRadioButton3
; Пользовательский
TCSEVIV7=TMyRadioButton2
; Автовыбор
TCSEVIV8=TMyRadioButton1
; Шрифт
; ANSI: по умолчанию
TCSEVIV9=TCheckBox9
; кнопка шрифта (Microsoft Sans Serif.-15.b)
TCSEVIV10=TButton8
; ASCII: по умолчанию
TCSEVIV11=TCheckBox8
; кнопка шрифта (Microsoft Sans Serif.-15.b)
TCSEVIV12=TButton7
; Пользовательский по умолчанию
TCSEVIV13=TCheckBox7
; кнопка шрифта (Microsoft Sans Serif.-15.b)
TCSEVIV14=TButton6
; Ширина строки (в символах)
; Текст:
TCSEVIV15=TEdit4
; Двоичный:
TCSEVIV16=TEdit3
; Результаты поиска В строке от начала листа:
TCSEVIV17=TEdit2
; Мультимедиа
; Использовать плагины / Выводить графику
TCSEVIV18=TCheckBox6
; Воспроизводить мультимедиа
TCSEVIV19=TCheckBox4
; RTF как текст
TCSEVIV20=TCheckBox1
; IrfanView/XnView для неподдерживаемых изображений
TCSEVIV21=TCheckBox5
; Путь:
TCSEVIV22=TEdit1
; [>>]
TCSEVIV23=TButton2
; Выводить HTML как текст со ссылками
TCSEVIV24=TCheckBox3
; Ссылки HTML в {фигурных скобках}
TCSEVIV25=TCheckBox2
; LS-плагины
TCSEVIV26=TButton1
; OK
TCSEVIV27=TButton5
; Отмена
TCSEVIV28=TButton4
; Справка
TCSEVIV29=TButton3

; -= НАСТРОЙКА: ОПЕРАЦИИ С ФАЙЛАМ =-
; Автоматический выбор способа копирования (рекомендуется)
TCSOF1=TCheckBox1
; Способ копирования (только для опытных пользователей!)
; Только стандартный способ (надёжно, но не очень быстро)
TCSOF2=TRadioButton3
; Размер буфера для маленьких файлов:
; Источник и получатель на одном диске:
TCSOF3=TEdit6
; Источник и получатель на разных дисках
TCSOF4=TEdit5
; Также использовать режим больших файлов (без кэша)
TCSOF5=TRadioButton2
; Размер буфера для больших файлов:
; Источник и получатель на одном диске:
TCSOF6=TEdit4
; Источник и получатель на разных дисках
TCSOF7=TEdit3
; Следующие логические диски находятся на одном жёстком диске
TCSOF8=TEdit1
; Использовать режим совместимости для следующих дисков
TCSOF9=TCheckBox7
; Введите буквы дисков, т.е. CDEF. или
TCSOF10=TEdit2
; USB флэш-диски
TCSOF11=TCheckBox6
; Выполнять копирование/вставку Проводником (при проблемах)
TCSOF12=TRadioButton1
; Общие настройки копирования и удаления
; Копировать дату/время каталогов
TCSOF13=TCheckBox5
; Verify after copyng (MD5 checksum)
TCSOF20=TCheckBox2
; Удалять Проводником (быстрее, но игнорирует комментарии)
TCSOF14=TCheckBox4
; удаление в Корзину (с Shift - окончательно)
TCSOF15=TCheckBox3
; OK
TCSOF16=TButton30
; Отмена
TCSOF17=TButton29
; Справка
TCSOF18=TButton27
; Применить
TCSOF19=TButton28


; -= НАСТРОЙКА: АВТООБНОВЛЕНИЕ =-
; Автообновление при переключении на ТС
; Не обновлять следующие диски:
TCSAU1=TEdit3
; Не запоминать следующие диски при выходе
TCSAU2=TEdit2
; Автообновление при изменениях в файловой системе
; Обновлять при создании, удалении и переименовании файлов
TCSAU3=TCheckBox6
; Также обновлять при изменении размера, даты или атрибутов
TCSAU4=TCheckBox5
; Добавлять файлы в КОНЕЦ списка (по умолчанию: сортировать)
TCSAU5=TCheckBox4
; Не реагировать на изменения, если окно ТС неактивно
TCSAU6=TCheckBox3
; Обновлять строку состояния (общее количество файлов)
TCSAU7=TCheckBox2
; Обновлять информацию о свободном дисковом пространстве
TCSAU8=TCheckBox1
; Не обновлять следующие диски:
TCSAU9=TEdit1
; OK
TCSAU10=TButton30
; Отмена
TCSAU11=TButton29
; Справка
TCSAU12=TButton27
; Применить
TCSAU13=TButton28

; -= НАСТРОЙКА: БЫСТРЫЙ ПОИСК =-
; Поиск в текущем каталоге
; Ctrl+Alt+буква
TCSFS1=TRadioButton5
; Alt+буква
TCSFS2=TRadioButton4
; Только буква
TCSFS3=TRadioButton3
; Буква (с диалогом поиска)
TCSFS4=TRadioButton2
; Отключён
TCSFS5=TRadioButton1
; Точное соответствие имени:
; Начало (имя должно начинаться с набранных символов)
TCSFS6=TCheckBox2
; Конец (последние символы до набранной точки должны со
TCSFS7=TCheckBox1
; OK
TCSFS8=TButton30
; Отмена
TCSFS9=TButton29
; Справка
TCSFS10=TButton27
; Применить
TCSFS11=TButton28

; -= НАСТРОЙКА: FTP =-
; Количество попыток при занятом FTP-сервере
TCSFTP1=TEdit7
; Задержка между попытками (секунд)
TCSFTP2=TEdit6
; Режим по умолчанию: (Двоичный (zip. doc и т.д.))
TCSFTP3=TMyComboBox2
; Открывать новые соединен
TCSFTP4=TMyComboBox1
; Создать файл отчёта: (в активной панели)
TCSFTP5=TCheckBox8
TCSFTP6=TEdit5
; [>>]
TCSFTP7=TButton1
; Выполнять все загрузки в фоновом режиме
TCSFTP8=TCheckBox7
; По умолчанию использовать пассивный режим
TCSFTP9=TCheckBox6
; Режим PORT: использовать только порты:
TCSFTP10=TCheckBox3
TCSFTP11=TEdit4
TCSFTP12=TEdit3
; Режим PORT: внешний адрес (IP/DNS/HTTP):
TCSFTP13=TCheckBox1
TCSFTP14=TEdit1
; Сжимать данные при пересылке (MODE Z)
TCSFTP15=TCheckBox5
; Не в LAN-сети
TCSFTP16=TCheckBox4
; Автовозобновление, если данные не поступали в течении
TCSFTP17=TCheckBox2
TCSFTP18=TEdit2
; OK
TCSFTP19=TButton31
; Отмена
TCSFTP20=TButton30
;TCSFTP21  - Справка
TCSFTP21=TButton28
; Применить
TCSFTP22=TButton29

; -= НАСТРОЙКА: ПЛАГИНЫ =-
; Скачать новые плагины с сайта... [>>]
TCSPL1=TButton1
; Архиваторные плагины (.WCX)... Настройка [>>]
TCSPL2=TButton5
; Плагины файловой системы (.WFX)... Настройка [>>]
TCSPL3=TButton4
; Плагины внутреннего просмотрщика (.WLX)... Настройка [>>]
TCSPL4=TButton3
; Информационные плагины (.WDX)... Настройка [>>]
TCSPL5=TButton2
; OK
TCSPL6=TButton30
; Отмена
TCSPL7=TButton29
; Справка
TCSPL8=TButton27
; Применить
TCSPL9=TButton28
; --------------------------------------
; Диалог файловые ассоциации (кнопка: Архиваторные плагины (.WCX)... Настройка [>>])
; класс окна файловые ассоциации
TCSPLWCX=TASSOCIATEDLG
;  список программ
TCSPLWCX1=ComboLBox1
; открывать с помощью:
TCSPLWCX2=Edit1
; окно выбора расширения
TCSPLWCX3=Edit2
; кнопка в окне выбора расширения ▼
TCSPLWCX4=TMyComboBox2
; Обзор...
TCSPLWCX5=TButton3
; OK
TCSPLWCX6=TButton5
; Отмена
TCSPLWCX7=TButton4
; Справка
TCSPLWCX8=TButton2
; --------------------------------------
; Диалог плагины файловой системы (кнопка: Плагины файловой системы (.WFX)... Настройка [>>])
; класс окна плагинов файловой системы
TCSPLWFX=TFsPluginConfigForm
; список установленных плагинов
TCSPLWFX1=TListBox1
; Добавить
TCSPLWFX2=TButton5
; Удалить
TCSPLWFX3=TButton4
; Переименовать
TCSPLWFX4=TButton1
; OK
TCSPLWFX5=TButton3
; Отмена
TCSPLWFX6=TButton2
; --------------------------------------
; Диалог плагины внутреннего просмотрщика (кнопка: Плагины внутреннего просмотрщика (.WLX)... Настройка [>>])
; класс окна плагинов внутреннего просмотрщика
TCSPLWLX=TFsPluginConfigForm
; список установленных плагинов
TCSPLWFL1=TListBox1
; вверх/низ
TCSPLWFL2=TScrollBar1
; Добавить
TCSPLWLX3=TButton5
; Удалить
TCSPLWLX4=TButton4
; Переименовать
TCSPLWLX5=TButton1
; OK
TCSPLWLX6=TButton3
; Отмена
TCSPLWLX7=TButton2
; --------------------------------------
; Диалог WDX плагинов (см. WLX)

; -= НАСТРОЙКА: ЭСКИЗЫ =-
; Эскизы: общие настройки
; Расположение базы данных (если пусто - кэширование отключено
TCSGR1=TEdit7
; [>>]
TCSGR2=TButton4
; По умолчанию
TCSGR3=TButton5
; Копировать/удалять эскизы с файлами
TCSGR4=TCheckBox9
; Дополнительные поля под эскизами (напр., размер картинки):
TCSGR5=TCheckBox8
; Добавить...
TCSGR6=TButton3
; Размер эскизов:
TCSGR7=TEdit6
TCSGR8=TEdit5
; По типу файлов
TCSGR9=TButton2
; Загрузка эскизов
; При помощи LS-плагинов для:
TCSGR10=TCheckBox3
TCSGR11=TEdit3
; Методом Проводника (OLE2) для:
TCSGR12=TCheckBox4
TCSGR13=TEdit4
; При помощи IrfanView/XnView для:
TCSGR14=TCheckBox1
TCSGR15=TEdit1
; В виде первых строк текста для:
TCSGR16=TCheckBox2
TCSGR17=TEdit2
; Сжать базу данных эскизов
; Удалить эскизы для отсутствующих файлов
TCSGR18=TCheckBox7
; Удалить эскизы для извлечённых CD-дисков
TCSGR19=TCheckBox5
; Удалить эскизы для недоступных дисков (напр., сетевых или USB)
TCSGR20=TCheckBox6
; Запуск
TCSGR21=TButton1
; OK
TCSGR22=TButton31
; Отмена
TCSGR23=TButton30
; Справка
TCSGR24=TButton28
; Применить
TCSGR25=TButton29

; ---------------------------------------------
; Предупреждение об изменении размеров эскизов
; класс окна
TCSGRW=#32770
; OK
TCSGRW1=Button1
; Отмена
TCSGRW2=Button2

; -= НАСТРОЙКА: ФАЙЛ ОТЧЁТА =-
; Отчёт о файловых операциях
; Создать файл отчёта:
TCSFR1=TCheckBox10
TCSFR2=TEdit3
; [>>]
TCSFR3=TButton1
; Протоколируемые действия
; Копирование / Перемещение / Создание ярлыков
TCSFR4=TCheckBox9
; Удаление
TCSFR5=TCheckBox8
; Создание/Удаление каталогов
TCSFR6=TCheckBox7
; Упаковка/Распаковка/Проверка архивов
TCSFR7=TCheckBox6
; Плагины файловой системы
TCSFR8=TCheckBox5
; Протоколировать операции со статусом:
; Успешные операции
TCSFR9=TCheckBox4
; Ошибки
TCSFR10=TCheckBox3
; Пропущенные файлы (при выборе «Пропустить». «Пропусти
TCSFR11=TCheckBox2
; Смена файла отчёта:
; Никогда (всё сохранять в один файл отчёта)
TCSFR12=TRadioButton3
; Каждый день после полуночи
TCSFR13=TRadioButton2
; Когда размер файла отчёта превысит
TCSFR14=TRadioButton1
; Кбайт
TCSFR15=TEdit2
; Хранить не более\
TCSFR16=TCheckBox1
; экземпляров файла отчёта
TCSFR17=TEdit1
;TCSFR18  - OK
TCSFR18=TButton31
; Отмена
TCSFR19=TButton30
; Справка
TCSFR20=TButton28
; Применить
TCSFR21=TButton29

; -= НАСТРОЙКА: СПИСОК ИСКЛЮЧЕНИЙ =-
; Исключить (не показывать) следующие файлы и каталоги:
TCSLE1=TCheckBox1
; окно исключающих файлов/каталогов
TCSLE2=TMyMemo1
; Сохранить в:
TCSLE3=TEdit1
; [>>]
TCSLE4=TButton1
; Добавить все выделенные с путями
TCSLE5=TButton2
; Добавить все выделенные
TCSLE6=TButton3
; OK
TCSLE7=TButton31
; Отмена
TCSLE8=TButton30
; Справка
TCSLE9=TButton28
;TCSLE10  - Применить
TCSLE10=TButton29

; -= НАСТРОЙКА: АРХИВАТОРЫ =-
; Входить в архивы, как в каталоги
TCSAZ1=TCheckBox4
; ARJ
; Архиватор ARJ:
TCSAZ2=TEdit5
; [>>]
TCSAZ3=TButton5
; По возможности использовать внутренний распаковщик
TCSAZ4=TCheckBox3
; Передавать длинные имена (ARJ 2.55 или новее: не для WinN
TCSAZ5=TCheckBox2
; LHA
; Архиватор LHA:
TCSAZ6=TEdit4
; [>>]
TCSAZ7=TButton4
;TCSAZ8 -  По возможности использовать внутренний распаковщик
TCSAZ8=TMyCheckBox3
; RAR
; Архиватор RAR:
TCSAZ9=TEdit3
; [>>]
TCSAZ10=TButton3
; По возможности использовать внутренний распаковщик
TCSAZ11=TMyCheckBox2
; UC2
; Архиватор UC2:
TCSAZ12=TEdit2
; [>>]
TCSAZ13=TButton2
; АСЕ
; АСЕ (>= 1,2Ь):
TCSAZ14=TEdit1
; [>>]
TCSAZ15=TButton1
; По возможности использовать внутренний распаковщик
TCSAZ16=TMyCheckBox1
; TAR
; Создавать TAR-архивы для Linux (иначе - для SunOS)
TCSAZ17=TCheckBox1
; Дополнительные архиваторы; WCX-плагины:
; Настройка архиваторных плагинов »
TCSAZ18=TButton6
; OK
TCSAZ19=TButton35
; Отмена
TCSAZ20=TButton34
; Справка
TCSAZ21=TButton32
; Применить
TCSAZ22=TButton33

; -= НАСТРОЙКА: АРХИВАТОР ZIP =-
; ZIP
; ZIP-упаковщик:
TCSZP1=TEdit4
; [>>]
TCSZP2=TButton2
; Применять внутр. упаковщик
TCSZP3=TCheckBox7
; Использовать Zip-NT 2.0.1
TCSZP4=TCheckBox6
; ZIP-распаковщик
TCSZP5=TEdit3
; [>>]
TCSZP6=TButton1
; По возможности использовать внутренний распаковщик
TCSZP7=TCheckBox5
; Степень сжатия внутреннего ZIP-упаковщика (0-9)
; Нормальное (6)
TCSZP8=TRadioButton6
; Максимальное (9)
TCSZP9=TRadioButton5
; Быстрое (1)
TCSZP10=TRadioButton4
; Другое:
TCSZP11=TRadioButton3
TCSZP12=TEdit2
TCSZP13=TScrollBar1
; Временный каталог для внутреннего ZIP-упаковщика
; По умолчанию (переменная окружения TEMP)
TCSZP14=TRadioButton2
; О Другой:
TCSZP15=TRadioButton1
TCSZP16=TEdit1
; Дополнительные установки при упаковке/распаковке
; Имена в формате 8.3
TCSZP17=TCheckBox4
; Дата архива по новейшему файлу
TCSZP18=TCheckBox3
; Открывать неполные ZIP
TCSZP19=TCheckBox2
; Работать с повреждёнными ZIF
TCSZP20=TCheckBox1
; Упаковка юникодных имён:
TCSZP21=TMyComboBox1
; OK
TCSZP22=TButton32
; Отмена
TCSZP23=TButton31
; Справка
TCSZP24=TButton29
; Применить
TCSZP25=TButton30

; -= НАСТРОЙКА: РАЗНОЕ =-
; Запрашивать подтверждение при:
; удалении непустых каталогов
TCSMC1=TCheckBox6
; перезаписи (замене) файлов
TCSMC2=TCheckBox10
; перезаписи/удалении файлов «только для чтения»
TCSMC3=TCheckBox9
; перезаписи/удалении скрытых и системных файлов
TCSMC4=TCheckBox8
; перетаскивании файлов мышью (Drag&Drop)
TCSMC5=TCheckBox7
; Переопределить горячие клавиши
; Клавиша:
TCSMC6=TRadioButton2
; [▼]
TCSMC7=TBitBtn1
; Ctrl +
TCSMC8=TCheckBox5
; Alt +
TCSMC9=TCheckBox4
; Shift +
TCSMC10=TCheckBox3
; Win +
TCSMC11=TCheckBox2
TCSMC12=TMyComboBox2
; Псевдоним:
TCSMC13=TRadioButton1
TCSMC14=Edit1
; Команда:
TCSMC15=TAltEdit1
TCSMC16=TBitBtn2
TCSMC17=TBitBtn3
; Звуки
; Настроить>>
TCSMC18=TButton1
; При операциях с длительностью:
TCSMC19=TCheckBox1
; >
TCSMC20=TEdit1
; OK
TCSMC21=TButton23
; Отмена
TCSMC22=TButton22
; Справка
TCSMC23=TButton20
; Применить
TCSMC24=TButton21

; -= ВЫБОР КОМАНДЫ =-
; класс окна выбора команды
TCTEAMSEL=TCmdSelForm
; Категория
TCTEAMSEL1=TMyListBox2
; Команда
TCTEAMSEL2=TMyListBox1
; Фильтр
TCTEAMSEL3=TAltEdit1
; OK
TCTEAMSEL4=TButton6
; Отмена
TCTEAMSEL5=TButton5
; при пункте UserCmd.ini, Wcmd_Rus.ini
; Новая
TCTEAMSEL6=TButton4
; Правка
TCTEAMSEL7=TButton3
; Удалить
TCTEAMSEL8=TButton2
; Сменить имя/Копия
TCTEAMSEL9=TButton1
;------------------------------------------
; ввод новой команды (кнопка Новая)
; класс окна
TCTEAMNEW=TSTDTREEDLG
; Новое имя команды (em_xyz): 
TCTEAMNEW1=TAltEdit1
; Ок
TCTEAMNEW2=TButton3
; Отмена
TCTEAMNEW3=TButton1
; ------------------------------------------
; Изменение пользовательской команды (кнопка Правка...)
; см. классы -= НАСТРОЙКА ПАНЕЛИ ИНСТРУМЕНТОВ (для одного значка) -=
; ------------------------------------------
; смена/копия пользовательской команды (кнопка Сменить имя/Копия)
; см. TCTEAMNEW
; Сохранить копию существующей команды
TCTEAMNEW4=TMyCheckBox1

; -= КОПИРОВАНИЕ/ПЕРЕМЕЩЕНИЕ =-
; Класс окна
TCCOPY=TInpComboDlg
; Копировать файлы в:
TCCOPY1=TAltEdit1
; Опции
TCCOPY2=TButton2
; Только файлы типа:
TCCOPY3=Edit1
TCCOPY4=TMyComboBox1||0||TMyComboBox2||1||Configuration||ShowCopyOptions
; Копировать права доступа NTFS (нужны админ, права)
TCCOPY5=TMyCheckBox3
; C проверкой MD
TCCOPY14=TMyCheckBox1
; [+] Выбор шаблона
TCCOPY15=TButton1
; ОК
TCCOPY6=TButton6
; F2 В очередь
TCCOPY7=TButton2
; Дерево
TCCOPY8=TButton5
; Отмена
TCCOPY9=TButton4
; Дополнительные настройки
TCCOPY10=TMyComboBox1
; Настройки перезаписи
; Пропустить файлы, недоступные для чтения
TCCOPY11=TCheckBox3
; Переписать/удалить скрытые/системные/только для чтения
TCCOPY12=TCheckBox2
; П Копировать во все выделенные папки/ссылки целевой панели
TCCOPY13=TCheckBox1

; -= КОПИРОВАНИЕ/ПЕРЕМЕЩЕНИЕ (при режиме показа всех файлов без подкаталогов)=-
; Класс окна
TCCOPYD=TInpComboDlg
; Копировать файлы в:
TCCOPYD1=TAltEdit1
; Только файлы типа:
TCCOPYD3=Edit1
TCCOPYD4=TMyComboBox1||0||TMyComboBox2||1||Configuration||ShowCopyOptions
; Копировать права доступа NTFS (нужны админ, права)
TCCOPYD5=TMyCheckBox3
; C проверкой MD5
TCCOPYD14=TMyCheckBox1
;Сохранять пути относительно текущего каталога
TCCOPYD16=TMyCheckBox2
; [+] Выбор шаблона
TCCOPYD15=TButton1
; ОК
TCCOPYD6=TButton6
; F2 В очередь
TCCOPYD7=TButton2
; Дерево
TCCOPYD8=TButton5
; Отмена
TCCOPYD9=TButton4
; Дополнительные настройки
TCCOPYD10=TMyGroupBox1
; Настройки перезаписи
; Пропустить файлы, недоступные для чтения
TCCOPYD11=TCheckBox3
; Переписать'удалить скрытые'системные'только для чтения
TCCOPYD12=TCheckBox2
; П Копировать во все выделенные папки/ссыпки целевой панели
TCCOPYD13=TCheckBox1

; -= КОПИРОВАНИЕ/ПЕРЕМЕЩЕНИЕ НA/С СЕРВЕРА (FTP)=-
TCCOPYFTP=TCheckEditBox
; Закачать как: / Загрузить в:
TCCOPYFTP1=TAltEdit1
; Закачать в фоновом режиме (отдельный поток) / Загрузить в фоновом режиме (отдельный поток)
TCCOPYFTP2=TMyCheckBox3
; Сохранять дату/время создания файлов
TCCOPYFTP3=TMyCheckBox2
; Перевести имена файлов в нижний регистр / Загрузить позже (добавить в список загрузок)
TCCOPYFTP4=TMyCheckBox1
; ОК
TCCOPYFTP5=TButton3
; Отмена
TCCOPYFTP6=TButton2
; Дерево
TCCOPYFTP7=TButton1

; -= ВНУТРЕННИЕ АССОЦИАЦИИ	=-
; класс окна внутренних ассоциаций
TCIASS=TDlgCustomColors
; правка):
TCIASS1=TMyListBox1
; Добавить...
TCIASS2=TButton5
; Правка...
TCIASS3=TButton4
; Удалить
TCIASS4=TButton3
; OK
TCIASS5=TButton2
; Отмена
TCIASS6=TButton1
;-----------------------------------------------
; диалог выбора маски (кнопка Добавить...)
; класс окна
TCMASK=TCOMBOINPUT
; ':')
TCMASK1=Edit1
TCMASK2=TMyComboBox1
; или выберите тип файлов по шаблону:
TCMASK3=TListBox1
; Шаблон...
TCMASK4=TButton1
; OK
TCMASK5=TButton3
; Отмена
TCMASK6=TButton2
;-----------------------------------------------
; Редактирование свойств типа файлов (кнопка Правка)
; класс окна
TCETYPE=TEditTypeForm
; Изменить значок...
TCETYPE1=TButton10
; Название типа:
TCETYPE2=TAltEdit1
; [>>]
TCETYPE3=TButton1
; Описание типа:
TCETYPE4=TAltEdit3
; Действия:
; Открыть
TCETYPE5=TAltEdit2
; [>>]
TCETYPE6=TButton1
TCETYPE7=TBkGndListBox1
; Создать...
TCETYPE8=TButton9
; Изменить...
TCETYPE9=TButton8
; Удалить
TCETYPE10=TButton7
; По умолчанию
TCETYPE11=TButton3
TCETYPE12=TScrollBar1
; ОК
TCETYPE12=TButton5
; Отмена
TCETYPE13=TButton6
; Справка
TCETYPE14=TButton2
; --------------------------------------------
; Изменить значок (кнопка Изменить значок...)
; класс окна
TCCICON=TChooseIcon
; Имя файла со значком:
TCCICON1=TAltEdit1
; [>>]
TCCICON2=TButton3
; значки
TCCICON3=TListBox1
; номер значка
TCCICON4=TEdit1
; OK
TCCICON5=TButton2
; 	Отмена
TCCICON6=TButton1
; -----------------------------------
; Изменение действия... (кнопка Создать... или Изменить... )
; класс окна
TCEACT=TEdActionForm
; Действие:
TCEACT1=TAltEdit3
; Описание (в контекстном меню):
TCEACT2=TAltEdit2
; Команда (программа):
TCEACT3=TAltEdit1
; [>>]
TCEACT4=TButton4
; OK
TCEACT5=TButton3
; Отмена
TCEACT6=TButton2
; Справка
TCEACT7=TButton1

; -= ИЗМЕНЕНИЕ АТРИБУТОВ =-
; класс окна
TCATTR=TATTRIBDLG
; Обрабатывать содержимое каталогов
TCATTR1=TCheckBox2
; Изменение атрибутов
; a Архивный
TCATTR2=TMyCheckBox5
; r Только для чтения
TCATTR3=TMyCheckBox4
; h Скрытый
TCATTR4=TMyCheckBox3
; s Системный
TCATTR5=TMyCheckBox2
; Изменение даты/времени:
TCATTR6=TMyCheckBox1
; Текущие
TCATTR7=TButton2
; Дата:
TCATTR8=TEdit2
; Время:
TCATTR9=TEdit1
; [>>]
TCATTR10=TButton1
; Использовать плагины:
TCATTR11=TCheckBox1
; F2 Шаблоны...
TCATTR12=TMyComboBox1
; Плагин: Свойство: Значение:
TCATTR13=TScrollBox1
; Добавить атрибут
TCATTR14=TButton5
; Удалить атрибут
TCATTR15=TButton4
; Загрузить из файла под курсором
TCATTR16=TButton3
; OK
TCATTR17=TButton8
; Отмена
TCATTR18=TButton7
; Справка
TCATTR19=TButton6
; дополнительные при нажатии на кнопку Добавить атрибут
; Плагин:
TCATTR20=TMyComboBox3
; Свойство:
TCATTR21=TMyComboBox2
; Значение:
TCATTR22=TAltEdit1
; [>>]
TCATTR23=TButton5
; [+]
TCATTR24=TButton4
; ---------------------------
; Изменение даты/времени: (кнопка [>>])
; класс окна
TCATTRD=TDateTimePickForm
TCATTRD1=TDateTimePickControl2
TCATTRD2=TDateTimePickControl1
TCATTRD3=msctls_updown32-1
; OK
TCATTRD4=TButton2
; Отмена
TCATTRD5=TButton1

; -= ИЗМЕНЕНИЕ АТРИБУТОВ на FTP=-
; класс окна
TCATRFTP=TChmodForm
; - Владелец
; Чтение 
TCATRFTP1=TMyCheckBox9
; Запись 
TCATRFTP2=TMyCheckBox8
; Выполнение 
TCATRFTP3=TMyCheckBox7
; Бит SET UID
TCATRFTP4=TCheckBox3
; - Член группы
; Чтение 
TCATRFTP5=TMyCheckBox6
; Запись 
TCATRFTP6=TMyCheckBox5
; Выполнение 
TCATRFTP7=TMyCheckBox4
; Бит SET UID
TCATRFTP8=TCheckBox2
; - Прочие
; Чтение 
TCATRFTP9=TMyCheckBox3
; Запись 
TCATRFTP10=TMyCheckBox2
; Выполнение 
TCATRFTP11=TMyCheckBox1
; Бит SET UID
TCATRFTP12=TCheckBox1
; поле флага
TCATRFTP13=TEdit1
; OK
TCATRFTP14=TButton3
; Отмена
TCATRFTP15=TButton2
; Справка
TCATRFTP16=TButton1

; -= КОММЕНТАРИЙ К ФАЙЛУ =-
; класс окна
TCCOMM=TCmtEditForm
; Правка комментария к:
TCCOMM1=TMemo1
; Шрифт OEM (DOS)
TCCOMM2=TCheckBox1
; F2 OK
TCCOMM3=TButton3
; Отмена
TCCOMM4=TButton2
; Справка
TCCOMM5=TButton1

; -= ПОИСК ФАЙЛОВ =-
; класс окна
TCFIND=TFindFile
; Общие параметры
TCFIND1=TMyTabbedNotebook1
; Искать файлы
TCFIND2=Edit3
; ▼
TCFIND3=TMyComboBox4
; Место поиска
TCFIND4=Edit2
; ▼
TCFIND5=TMyComboBox3
; [>>]
TCFIND6=TButton2
; Диски...
TCFIND7=TButton3
; Рег.выраж.
TCFIND8=TCheckBox3
; Только в выделенных файлах/каталогах
TCFIND9=TCheckBox8
; Искать также в архивах (кроме UC2)
TCFIND10=TCheckBox14
; Глубина вложенности подкаталогов
TCFIND11=TMyComboBox1
; С текстом:
TCFIND12=TCheckBox13
TCFIND13=Edit1
; ▼
TCFIND14=TMyComboBox2
; Только слова целиком
TCFIND15=TCheckBox12
; Учитывать регистр символов
TCFIND16=TCheckBox11
; В кодировке ASCII (DOS)
TCFIND17=TCheckBox10
; Файлы. НЕ содержащие этот текст
TCFIND18=TCheckBox9
; UTF-16
TCFIND19=TCheckBox7
; НЕХ-код
TCFIND20=TCheckBox6
; Регулярные выражения
TCFIND21=TCheckBox4
; UTF-8
TCFIND22=TCheckBox3
; ANSI (Windows)
TCFIND81=TCheckBox2
; Office xml (docx,xlsx, odf etc)+EPUB
TCFIND82=TCheckBox1
; Начать поиск
TCFIND23=TButton14
; Отмена
TCFIND24=TButton13
; Справка
TCFIND25=TButton1
; Дополнительно
; Дата между
TCFIND26=TCheckBox5
TCFIND27=TEdit4
; [>>]
TCFIND28=TButton4
; и
TCFIND29=TEdit3
; [>>]
TCFIND30=TButton3
; Не старше
TCFIND31=TCheckBox4
TCFIND32=TEdit2
TCFIND33=TScrollBar2
TCFIND34=TMyComboBox4
; ▼
TCFIND35=TMyComboBox4
; Размер файла
TCFIND36=TCheckBox3
; ▼
TCFIND37=TMyComboBox3
TCFIND38=TEdit1
TCFIND39=TScrollBar1
; ▼
TCFIND40=TMyComboBox2
; Атрибуты:
TCFIND41=TCheckBox2
; Архивный
TCFIND42=TMyCheckBox11
; Скрытый
TCFIND43=TMyCheckBox10
; Каталог
TCFIND44=TMyCheckBox9
; Зашиф.
TCFIND45=TMyCheckBox2
; Для чтения
TCFIND46=TMyCheckBox8
; Системный
TCFIND47=TMyCheckBox7
; Сжатый
TCFIND48=TMyCheckBox3
; Поиск дубликатов:
TCFIND49=TCheckBox1
; по имени
TCFIND50=TCheckBox5
; по размеру
TCFIND51=TCheckBox4
; по содержимому
TCFIND52=TCheckBox6
; поиск с плагинами (same pluginfields)
TCFIND75=TMyCheckBox1
TCFIND76=Edit1
; ▼
TCFIND77=TMyComboBox1
; [+]
TCFIND78=TButton2
; Начать поиск
TCFIND79=TButton17
; Отмена
TCFIND80=TButton16
; ----------- во вкладке Дополнительно (при получении результатов поиска)
; Просмотр
TCFIND83=TButton12
; Новый поиск
TCFIND84=TButton15
; Перейти к файлу
TCFIND85=TButton14
; Файлы на панель
TCFIND86=TButton13

; Плагины
; Поиск с плагинами Объединять:
TCFIND53=TCheckBox1
; И: все правила
TCFIND54=TRadioButton2
; ИЛИ: хотя бы одно
TCFIND55=TRadioButton1
; Плагин:
TCFIND56=TMyComboBox3
; Свойство:
TCFIND57=TMyComboBox2
; Операция:
TCFIND58=TMyComboBox1
; Значение:
TCFIND59=TAltEdit1
; Новое правило
TCFIND60=TButton3
; Удалить правило
TCFIND61=TButton2
; Шаблоны Поиска
; Сохранённые шаблоны поиска:
TCFIND62=TListBox1
TCFIND63=TPanel1
; Загрузить
TCFIND64=TButton4
; Сохранить
TCFIND65=TButton3
; Удалить
TCFIND66=TButton2
; при получении результатов поиска
; Просмотр
TCFIND67=TButton9
; Новый поиск
TCFIND68=TButton12
; Перейти к файлу
TCFIND69=TButton11
; Файлы на панель
TCFIND70=TButton10

; ----------- во вкладках Плагины, Шаблон поиска (при получении результатов поиска)
; Просмотр
TCFIND71=TButton11
; Новый поиск
TCFIND72=TButton14
; Перейти к файлу
TCFIND73=TButton13
; Файлы на панель
TCFIND74=TButton12
; ----------------------------------
; Сохранение шаблона (кнопка Сохранить)
; класс окна
TCFINDSAVE=TSTDTREEDLG
; Имя шаблона
TCFINDSAVE1=TAltEdit1
; OK
TCFINDSAVE2=TButton3
; Отмена
TCFINDSAVE3=TButton1

; -= НАСТРОЙКА ПАНЕЛИ ИНСТРУМЕНТОВ =-
; класс окна
TCCUZBAR=TBUTTONCHANGEDLG
; Панель:
TCCUZBAR1=TMyPanel1
; [>>]
TCCUZBAR2=TButton8
TCCUZBAR3=TListBox2
; Добавить
TCCUZBAR4=TButton6
; Удалить
TCCUZBAR5=TButton7
; Вид кнопок
; Размер:
TCCUZBAR6=TEdit2
; Стиль XP/Vista/
TCCUZBAR7=TCheckBox1
; Плоские
TCCUZBAR8=TCheckBox3
; Маленькие
TCCUZBAR9=TCheckBox2
TCCUZBAR10=TEdit1
; Команда:
TCCUZBAR11=TAltEdit5
TCCUZBAR12=TBitBtn1
; Изменить >>
TCCUZBAR13=TButton5
; Параметры:
TCCUZBAR14=TAltEdit4
; Путь запуска:
TCCUZBAR15=TAltEdit3
; Файл значка:
TCCUZBAR16=TAltEdit2
; [>>]
TCCUZBAR17=TButton4
; Значок:
TCCUZBAR18=TListBox1
; Подсказка:
TCCUZBAR19=TAltEdit1
; в свёрнутом виде
TCCUZBAR20=TCheckBox5
; в полный экран
TCCUZBAR21=TCheckBox4
; ОК
TCCUZBAR22=TButton3
; Отмена
TCCUZBAR23=TButton2
; Справка
TCCUZBAR24=TButton1

; -= НАСТРОЙКА ПАНЕЛИ ИНСТРУМЕНТОВ (для одного значка) -=
; класс окна
TCONEBAR=TONEBUTTONCHANGEDLG
; Команда:
TCONEBAR1=TAltEdi5
; кнопка выбора команды
TCONEBAR2=TBitBtn1
; Изменить >>
TCONEBAR3=TButton5
; Параметры:
TCONEBAR4=TAltEdit4
; Путь запуска:
TCONEBAR5=TAltEdit3
; Файл значка:
TCONEBAR6=TAltEdit2
; [>>]
TCONEBAR7=TButton4
; Значок:
TCONEBAR8=TListBox1
; Подсказка:
TCONEBAR9=TAltEdit1
; в свёрнутом виде
TCONEBAR10=TCheckBox2
; в полный экран
TCONEBAR11=TCheckBox1
; ОК
TCONEBAR12=TButton3
; Отмена
TCONEBAR13=TButton2
; Справка
TCONEBAR14=TButton1


; -= СРАВНЕНИЕ СОДЕРЖИМОГО ФАЙЛОВ =-
; класс окна
TCCOMP=TFileCompForm
; окно 1-го файла
TCCOMP1=TAltEdit2
; [>>]
TCCOMP2=TButton10
; окно 2-го файла
TCCOMP3=TAltEdit1
; [>>]
TCCOMP4=TButton9
; Сравнить
TCCOMP5=TButton11
; Следующее отличие
TCCOMP6=TButton8
; Предыдущее отличие
TCCOMP7=TButton7
; Шрифт
TCCOMP8=TButton6
; Редактирование
TCCOMP9=TButton5
; Копировать ->
TCCOMP10=TButton4
; Копировать <-
TCCOMP11=TButton3
; Откат
TCCOMP12=TButton2
; ANSI<->ANSI
TCCOMP13=TButton1
; Двоичный
TCCOMP14=TCheckBox3
; 3 галочки
TCCOMP15=TCheckBox4
TCCOMP16=TCheckBox2
TCCOMP17=TCheckBox1
; кнопка Поиск (F7)
TCCOMP18=TBitBtn2
; кнопка Найти далее (F3)
TCCOMP19=TBitBtn1
; левая панель
TCCOMP20=TOwnListBox2
; правая панель
TCCOMP21=TOwnListBox1
; ---------------------------------------
; диалог поиска (кнопки Поиск (F7) и Найти далее (F3))
; класс окна
TCSEARCH=TSEARCHTEXT
; Введите строку для поиска
TCSEARCH1=Edit1
; [>>]
TCSEARCH2=TMyComboBox1
; Только слова целиком
TCSEARCH3=TCheckBox5
; В обратном направлении
TCSEARCH4=TCheckBox3
; Учитывать регистр
TCSEARCH5=TCheckBox4
; О НЕХ-код
TCSEARCH6=TCheckBox2
; ОК
TCSEARCH7=TButton3
; Отмена
TCSEARCH8=TButton2
; Справка
TCSEARCH9=TButton1

; -= ИЗМЕНЕНИЕ МЕТКИ ДИСКА =-
; класс окна
TCLABEL=TVOLLABELDLG
; Метка диска:
TCLABEL1=TAltEdit1
; ОК
TCLABEL2=TButton2
; Отмена
TCLABEL3=TButton1

; -= LISTER =-
; класс окна
TCLISTER=TLister

; -= УПАКОВКА ФАЙЛОВ =-
; класс окна
TCPACK=TDLGZIP
; Упаковать файлы (1 шт.) в архив:
TCPACK1=TAltEdit1
; Сохранять пути
TCPACK2=TCheckBox8
; Учитывать подкаталоги
TCPACK3=TCheckBox7
; Многотомные архивы (ZIP. ARJ. RAR. АСЕ)
TCPACK4=TCheckBox6
; Удалить исходные файлы после упаковки
TCPACK5=TCheckBox5
; Самораспаковывающийся архив
TCPACK6=TCheckBox4
; Отдельные архивы для каждого выбранного файла/каталога
TCPACK7=TCheckBox2
; Исключить каталоги верхнего уровня при упаковке папок
TCPACK25=TCheckBox1
; Шифровать
TCPACK8=TCheckBox3
; Архиватор
; ZIP
TCPACK9=TRadioButton10
; ARJ*
TCPACK10=TRadioButton9
; LHA*
TCPACK11=TRadioButton8
; RAR*
TCPACK12=TRadioButton7
; UC2*
TCPACK13=TRadioButton6
; ACE*
TCPACK14=TRadioButton5
; TAR
TCPACK15=TRadioButton3
; GZ
TCPACK16=TRadioButton2
; TGZ
TCPACK17=TRadioButton1
; ->
TCPACK18=TRadioButton4
TCPACK19=TComboBox1
; * Внешний упаковщик
; Настройка >>
TCPACK20=TButton2
; OK
TCPACK21=TButton5
; Дерево
TCPACK22=TButton4
; Отмена
TCPACK23=TButton3
; Справка
TCPACK24=TButton1
; -----------------------------------
; Диалог упаковки
; класс окна
TCPACKD=TDLG2FILEACTIONMIN
; Пауза/Старт
TCPACKD1=TButton1
; Отмена
TCPACKD2=TButton3
; В фоне
TCPACKD3=TButton2
; -----------------------------------
; Диалог при одинаковых именах упаковки
TCPACKRP=TOverWriteForm
; Заменить
TCPACKRP1=TButton8
; Заменить всё
TCPACKRP2=TButton7
; Пропустить
TCPACKRP3=TButton6
; Отмена
TCPACKRP4=TButton5
; Заменить более старые
TCPACKRP5=TButton4
; Пропустить всё
TCPACKRP6=TButton3
; Переименовать
TCPACKRP7=TButton2
; Дополнительно >>
TCPACKRP8=TButton1

; -= ДЕРЕВО КАТАЛОГОВ =-
; класс окна
TCDIRTR=TCHANGETREEDLG
; список
TCDIRTR1=TMyListBox2-1
; Быстрый поиск:
TCDIRTR2=TMyPanel1
; ОК
TCDIRTR3=TButton4
; Отмена
TCDIRTR4=TButton3
; Печать...
TCDIRTR5=TButton2
; Справка
TCDIRTR6=TButton1

; -= ПРЕДВАРИТЕЛЬНЫЙ ПРОСМОТР =-
; класс окна
TCPREVIEW=TPrintDlg
; лист
TCPREVIEW1=TOwnerdrawPanel1
; Шрифт:
TCPREVIEW2=TMyComboBox5
; ▼
TCPREVIEW3=Edit1
TCPREVIEW4=TMyComboBox4
; Вид:
; ▼
TCPREVIEW5=TMyComboBox2
; ◄►
TCPREVIEW6=TScrollBar1
; ▼ (По ширине страницы)
TCPREVIEW7=TMyComboBox3
; ▼ (Document)
TCPREVIEW8=TMyComboBox1
; Настройка>>
TCPREVIEW9=TButton3
; Поля...
TCPREVIEW10=TButton1
; Печать...
TCPREVIEW11=TButton2
; с двух сторон
TCPREVIEW12=TCheckBox1
; ---------------------------------
; Настройка полей и колонтитула (кнопка Поля)
; класс окна
TCMARG=TMarginsDlg
; Поля
; Левое:
TCMARG1=TEdit5
; Верхнее:
TCMARG2=TEdit3
; Колонтитул:
TCMARG3=TEdit1
; Правое:
TCMARG4=TEdit4
; Нижнее:
TCMARG5=TEdit2
; Колонтитул
; Текст шаблона:
TCMARG6=TEdit1
; OK
TCMARG7=TButton2
; Отмена
TCMARG8=TButton1

; -= ПЕЧАТЬ=-
; класс окна
TCPRINT=
; Принтер
; Имя:
TCPRINT1=ComboBox1
; Свойства...
TCPRINT2=Button2
; Состояние:
TCPRINT3=Static3
; Тип:
TCPRINT4=Static5
; Место:
TCPRINT5=Static7
; Комментарий:
TCPRINT6=Static9
; Печать в Файл
TCPRINT7=Button3
; Все
; Диапазон печати
TCPRINT8=Button5
; Страницы
TCPRINT9=Button6
; с:
TCPRINT10=Edit1
; по:
TCPRINT11=Edit2
; Выделенный Фрагмент
TCPRINT12=Button7
; Копии
; Число копий:
TCPRINT13=Edit3
TCPRINT14=msctls_updown32-1
; ОК
TCPRINT15=Button10
; Отмена
TCPRINT16=Button11

; -= НАСТРОЙКА ПЕЧАТИ =-
; класс окна
TCSTPRINT=
; Принтер
; Имя:
TCSTPRINT1=ComboBox1
; Свойства...
TCSTPRINT2=Button2
; Бумага
; Размер:
TCSTPRINT3=ComboBox2
; Подача:
TCSTPRINT4=ComboBox3
; Ориентация
; Книжная
TCSTPRINT5=Button5
; Альбомная
TCSTPRINT6=Button6
; Сеть...
TCSTPRINT7=Button9
; ОК
TCSTPRINT8=Button7
; Отмена
TCSTPRINT9=Button8


; -= СОЕДИНЕНИЕ С FTP-СЕРВЕРОМ =-
; класс окна
TCONNECT=TCONNECT
; Соединиться с:
TCONNECT1=TMyListBox1
; Соединиться
TCONNECT2=TButton10
; Добавить...
TCONNECT3=TButton9
; Новый URL...
TCONNECT4=TButton8
; Копировать...
TCONNECT5=TButton7
; Новая папка...
TCONNECT6=TButton2
; Изменить...
TCONNECT7=TButton6
; Удалить
TCONNECT8=TButton5
; Шифровать..
TCONNECT9=TButton1
; Отмена
TCONNECT10=TButton4
; Справка
TCONNECT11=TButton3
; ---------------------------------------------------
; НАСТРОЙКА FTP-СОЕДИНЕНИЯ (кнопка Добавить...)
TCCONDET=TDETAILS
; Общие	(вкладка)
; Имя соединения:
TCCONDET1=TAltEdit6
; Сервер [:Порт]:
TCCONDET2=TAltEdit5
; SSUTLS
TCCONDET3=TCheckBox4
; Анонимное соединение (пароль-адрес E-mai	l)
TCCONDET4=TButton5
; Учётная запись:
TCCONDET5=TAltEdit4
; Пароль
TCCONDET6=TAltEdit1
; Использовать главный пароль для защиты пароля
TCCONDET7=TCheckBox3
; Удалённый каталог
TCCONDET8=TAltEdit3
; Локальный катало	г
TCCONDET9=TAltEdit2
; [>>]
TCCONDET10=TButton4
; Пассивный режим обмена (как Web-браузер)
TCCONDET11=TCheckBox2
; Использовать брандмауэр или прокси-сервер
TCCONDET12=TCheckBox1
; Определить новый...
TCCONDET13=TMyComboBox1
; Изменить...
TCCONDET14=TButton1
; Расширенные ->
TCCONDET15=TButton2
; OK
TCCONDET16=TButton8
; Отмена
TCCONDET17=TButton7
; Справка
TCCONDET18=TButton6
; -------------------------------------------
; ftp (кнопка Анонимное соединение (пароль-адрес E-mai	l))
; класс окна
TCCNDED=TSTDTREEDLG
; Укажите в качестве пароля адрес E-mail:
TCCNDED1=TAltEdit1
; OK
TCCNDED2=TButton3
; 	Отмена
TCCNDED3=TButton1
; -------------------------------------------
; НАСТРОЙКИ БРАНДМАУЭРА (кнопка Изменить...)
; класс окна
TCSFD=TFireWallDlg
; Способ соединения
; Послать команду USER user@hostname
TCSFD1=TMyRadioButton10
; Послать команду SITE (с входом в систему)
TCSFD2=TMyRadioButton9
; Послать команду OPEN
TCSFD3=TMyRadioButton8
; USER user@firewalluser@hostname I PASS pass@firewallpas
TCSFD4=TMyRadioButton7
; Прозрачный
TCSFD5=TMyRadioButton6
; HTTP-прокси с поддержкой FTP
TCSFD6=TMyRadioButton5
; SOCKS4
TCSFD7=TMyRadioButton4
; SOCKS5 (базовая аутентификация)
TCSFD8=TMyRadioButton3
; USER user@hostname firewalluser PASS pass ACCT firewallpc
TCSFD9=TMyRadioButton2
; HTTP CONNECT
TCSFD10=TMyRadioButton1
; Соединение через брандмауэр
; Сервер [:Порт]:
TCSFD11=TEdit3
; Учётная запись:
TCSFD12=TEdit2
; Пароль:
TCSFD13=TEdit1
; ОК
TCSFD14=TButton3
; Отмена
TCSFD15=TButton2
; Справка
TCSFD16=TButton1
; -------------------------------------------
; Настройка FTP-соединения
; Расширенные (вкладка)
; Послать команды:
TCCONDET19=TAltEdit1
; Тип сервера:
TCCONDET20=TMyComboBox1
; Посылать команду для поддержания соединения активным:
TCCONDET21=TCheckBox3
; Команда:
TCCONDET22=Edit1
; ▼
TCCONDET23=TMyComboBox3
; Посылать каждые:
TCCONDET24=TAltEdit2
; Кодировка имён файлов:
TCCONDET25=TMyComboBox2
; Получение списка командой MLSD (затенено = автовыбор)
TCCONDET26=TCheckBox2
; Запоминать содержимое всех посещённых каталогов
TCCONDET27=TCheckBox1

; ftp (кнопка Новый URL...)
; класс окна
TCCNDNEW=TNewConnDlg
; Соединиться с... (указать сервер или URL):
TCCNDNEW1=Edit1
; ▼
TCCNDNEW2=TMyComboBox2
; Анонимное соединение
TCCNDNEW3=TMyCheckBox2
; Использовать брандмауэр или прокси-сервер
TCCNDNEW4=TMyCheckBox1
; Определить новый...
TCCNDNEW5=TMyComboBox1
; Изменить...
TCCNDNEW6=TButton1
; ОК
TCCNDNEW7=TButton4
; Отмена
TCCNDNEW8=TButton3
; Справка
TCCNDNEW9=TButton2
; ----------------------------------------
; Total Commander (кнопка Новая папка...)
; класс окна
TCCNDF=TSTDTREEDLG
; Создать новый каталог (папку):
TCCNDF1=TAltEdit1
; ОК
TCCNDF2=TButton3
; Отмена
TCCNDF3=TButton1
; ----------------------------------
; Total Commander (кнопка Шифровать...)
; класс окна
TCCNDEN=TCTExtMsgForm
; Защитить подключения главным паролем.
TCCNDEN1=TButton2
; Отмена
TCCNDEN2=TButton1
; ------------------------------------
; Шифрование (кнопка Защитить подключения главным паролем)
; класс окна
TCCRYPT=TCryptOptions
; Опции
; Защитить только выбранные подключения
TCCRYPT1=TRadioButton3
; Защитить все незащищённые подключения
TCCRYPT2=TRadioButton2
; Защитить все подключения
TCCRYPT3=TRadioButton1
; Выводить диалог для подтверждения каждого изменения
TCCRYPT4=TCheckBox1
; ОК
TCCRYPT5=TButton2
; Отмена
TCCRYPT6=TButton1

; - (Загрузка) (команда Диспетчер фоновой пересылки)
; класс окна
TCTRNS=#32770
; [+]
TCTRNS1=Button1
; [-]
TCTRNS2=Button2
; Пауза
TCTRNS3=Button3
; Лимит скорости
TCTRNS4=Button4
TCTRNS5=Edit1

; Total Commander (команда Загрузить по списку)
; класс окна
TCNLD=TSTDTREEDLG
; Имя списка загрузок:
TCNLD1=TAltEdit1
; [>>]
TCNLD2=TButton1
; OK
TCNLD3=TButton4
; Отмена
TCNLD4=TButton2

; -= ПРИ ВКЛЮЧЁННОМ FTP (на панели главного окна) =-
TCFTPVIEW1=TPanel2
; Режим обмена
TCFTPVIEW2=TMyComboBox1
; Список
TMyListBox=1

; Total Commander (команда создания каталога F7)
TCNEWF=TCOMBOINPUT
; Создать новый каталог (папку):
TCNEWF1=Edit1
; [>>]
TCNEWF2=TMyComboBox1
; OK
TCNEWF3=TButton2
; Отмена
TCNEWF4=TButton1

; ГРУППОВОЕ ПЕРЕИМЕНОВАНИЕ
; класс окна
TCRENAME=TMultiRename
; Маска для: имени файла
TCRENAME1=Edit3
; ▼
TCRENAME2=TMyComboBox6
; [N] Имя; [N#-#] Диапазон; [С] Счётчик; [YMD] Дата; [hms] Время; [=?] Плагин
TCRENAME3=TMyGroupBox5
; Расширения
TCRENAME4=TAltEdit1
; [Е] Тип; [Е#-#] Диапазон; [С] Счётчик
TCRENAME5=TMyGroupBox1
; Поиск и замена
; Найти:
TCRENAME6=Edit1
; ▼
TCRENAME7=TMyComboBox3
; Заменить на:
TCRENAME8=Edit2
; ▼
TCRENAME9=TMyComboBox4
; ^  [ ]
TCRENAME10=TCheckBox3
; 1x [ ]
TCRENAME11=TCheckBox2
; [E]
TCRENAME12=TCheckBox1
; Рег.выраж.
TCRENAME13=TCheckBox5
; Подстан.
TCRENAME14=TCheckBox4
; Верхний/нижний регистр
TCRENAME15=TMyComboBox2
; [?]
TCRENAME16=TButton5
; [≡]
TCRENAME17=TBitBtn1
; Вид счётчика [С]
; Начать с:
TCRENAME18=TEdit2
TCRENAME19=TScrollBar2
; Шаг:
TCRENAME20=TEdit1
TCRENAME21=TScrollBar1
; К-во цифр:
TCRENAME22=TMyComboBox5
; F2 Шаблоны...
TCRENAME23=TMyComboBox1
; Старое имя; Тип; Новое имя
TCRENAME24=THeaderClick1
; Список
TCRENAME25=TBkGndListBox1
; Выполнить
TCRENAME26=TButton4
; Откат
TCRENAME27=TButton2
; Протокол
TCRENAME28=TButton1
; Закрыть
TCRENAME29=TButton3

; ------------------------------------
; Выбор дисков (кнопка Диски...)
; класс окна
TCDRIVE=TDriveSelBox
; Искать на дисках:
TCDRIVE1=TListBox1
; Все локальные
TCDRIVE2=TButton3
; ОК
TCDRIVE3=TButton2
; Отмена
TCDRIVE4=TButton1

; -= РАСПАКОВКА ФАЙЛОВ =-
TCUNPACK=TDLGUNZIPALL
; Распаковать файлы по указанной ниже маске из архива в:
TCUNPACK1=TAltEdit1
; Маска для распаковки
TCUNPACK2=Edit1
; ▼
TCUNPACK3=TMyComboBox1
; Учитывать подкаталоги
TCUNPACK4=TCheckBox3
; Заменять существующие файлы
TCUNPACK5=TCheckBox2
; Распаковать каждый архив в отдельный каталог
TCUNPACK6=TCheckBox1
; ОК
TCUNPACK7=TButton4
; Дерево
TCUNPACK8=TButton3
; Отмена
TCUNPACK9=TButton2
; Справка
TCUNPACK10=TButton1

; Распаковка файлов
TCUNZPACK=TDLGUNZIP
; Распаковать файлы в:
TCUNZPACK1=TAltEdit1
; Учитывать подкаталоги
TCUNZPACK2=TCheckBox2
; Заменять существующие файлы
TCUNZPACK3=TCheckBox1
; ОК
TCUNZPACK4=TButton4
; Дерево
TCUNZPACK5=TButton3
; Отмена
TCUNZPACK6=TButton2
; Справка
TCUNZPACK7=TButton1

; -= ДОБАВИТЬ ВЫДЕЛЕНИЕ =-
; класс окна
TCMARK=TCOMBOINPUT
; Укажите маску файлов (разделитель - ';')
TCMARK1=Edit1
; ▼
TCMARK2=TMyComboBox1
; список
TCMARK3=TListBox1
; Шаблон...
TCMARK4=TButton1
; OK
TCMARK5=TButton3
; Отмена
TCMARK6=TButton2

; -= ЗАДАТЬ ФИЛЬТР =-
; класс окна
TCFILTER=TCOMBOINPUT
; Укажите шаблон(ы) файлов (например: s*.doc;*.tx?)
TCFILTER1=Edit1
; ▼
TCFILTER2=TMyComboBox1
; или выберите тип файлов по шаблону:
TCFILTER3=TListBox1
; Шаблон...
TCFILTER4=TButton1
; OK
TCFILTER5=TButton3
; Отмена
TCFILTER6=TButton2

; -= НАСТРОЙКА МЕНЮ "ЗАПУСК" =-
; класс окна
TCUMENU=TUSERMENUCHANGE
; список
TCUMENU1=TListBox1
; Команда:
TCUMENU2=TAltEdit3
; кнопка выбора команды
TCUMENU3=TBitBtn1
; [>>] 
TCUMENU4=TButton1
; Параметры: 
TAltEdit2=TAltEdit2
; Путь запуска: 
TAltEdit3=TAltEdit1
; Горячая клавиша
TAltEdit4=TMyComboBox1
; в свёрнутом виде
TAltEdit5=TCheckBox2
; в полный экран
TAltEdit6=TCheckBox1
; Добавить...
TAltEdit7=TButton8
; Подменю...
TAltEdit8=TButton7
; Удалить
TAltEdit9=TButton6
; Переименовать
TAltEdit10=TButton5
; ОК
TAltEdit11=TButton4
; Отмена
TAltEdit12=TButton3
; Справка
TAltEdit13=TButton2
;------------------------------------
; диалоги через кнопки Добавить, Подменю, Переименовать
; см. TCTEAMNEW

; -= СОЗДАНИЕ ФАЙЛА (вызов по Shift+F4)=-
; класс окна
TCEDIT=TCheckEditBox
; Введите имя редактируемого файла
TCEDIT1=TAltEdit1
; ОК
TCEDIT2=TButton3
; Отмена
TCEDIT3=TButton2
; Дерево
TCEDIT4=TButton1

; [TOTALCOM64] - Классы, контролы, инстанции окон Total Commander 64 bit
[TOTALCOM64]
TOTAL=TTOTAL_CMD
TOTAL1=Window4
TOTAL2=Window3
TOTAL3=Window2
TOTAL4=LCLComboBox2
TOTAL5=LCLComboBox3
TOTAL6=Window7,Window8,Window9,Window10,Window11
TOTAL7=Window12,Window13,Window14,Window15,Window16
TOTAL8=SysTabControl32-1
TOTAL9=SysTabControl32-2
TOTAL10=Window7,Window8,Window9,Window10,Window11
TOTAL11=Window12,Window13,Window14,Window15,Window16
TOTAL12=Window1
TOTAL13=LCLListBox1
TOTAL14=LCLListBox2
TOTAL15=LCLListBox3
TOTAL16=THeaderClick1
TOTAL17=THeaderClick2
TOTAL18=Window5
TOTAL19=LCLListBox1
TOTAL20=LCLListBox2
TOTAL21=LCLListBox3
TOTAL22=LCLListBox4
TOTAL23=LCLListBox5

TCSETTING=TDLGCONFIGALL
TCSVW1=Button18
TCSVW2=Button17
TCSVW3=Button9
TCSVW4=Button10
TCSVW5=Button16
TCSVW6=Button7
TCSVW7=Button15
TCSVW8=Button6
TCSVW9=Button5
TCSVW10=Button8
TCSVW11=Button14
TCSVW12=Button13
TCSVW13=Button12
TCSVW14=Button11
TCSVW15=Button3
TCSVW16=Button2
TCSVW17=Button22
TCSVW18=Button21
TCSVW19=Button19
TCSVW20=Button20

TCSCP24=Button22
TCSCP1=Button16
TCSCP2=Button19
TCSCP3=Button21
TCSCP4=Button20
TCSCP5=Button18
TCSCP6=Button17
TCSCP7=Edit1
TCSCP8=LCLComboBox1
TCSCP9=Button3
TCSCP10=Button2
TCSCP11=Button14
TCSCP12=Button13
TCSCP13=Button11
TCSCP14=Button10
TCSCP15=Button9
TCSCP16=Button8
TCSCP17=Button6
TCSCP18=Button5
TCSCP19=Button7
TCSCP20=Button26
TCSCP21=Button25
TCSCP22=Button23
TCSCP23=Button24

TCSCPDTF=TDlgCustomColors
TCSCPDTF1=LCLListBox1
TCSCPDTF2=Button5
TCSCPDTF3=Button4
TCSCPDTF4=Button3
TCSCPDTF4=Button2
TCSCPDTF5=Button1

TCSIC1=Button11
TCSIC2=Button14
TCSIC3=Button13
TCSIC4=Button12
TCSIC5=Button10
TCSIC6=Button9
TCSIC7=Button8
TCSIC8=Button7
TCSIC9=Button6
TCSIC10=Edit1
TCSIC11=Window4
TCSIC12=Button4
TCSIC13=Button3
TCSIC14=Button2
TCSIC15=LCLComboBox1
TCSIC16=Button19
TCSIC17=Button18
TCSIC18=Button16
TCSIC19=Button17

TCSF1=Button9
TCSF2=Button6
TCSF3=Button3
TCSF4=Button13
TCSF5=Button12
TCSF6=Button10
TCSF7=Button11

TCSFFP1=Edit1
TCSFFP2=ComboLBox1
TCSFFP3=Edit2
TCSFFP4=ComboLBox2
TCSFFP5=Edit3
TCSFFP6=ComboLBox3
TCSFFP7=Button4
TCSFFP8=ComboBox5
TCSFFP9=Button5
TCSFFP10=Button6

TCSCL1=LCLComboBox8
TCSCL2=Button11
TCSCL3=LCLComboBox7
TCSCL4=Button10
TCSCL5=LCLComboBox1
TCSCL6=Button2
TCSCL7=LCLComboBox6
TCSCL8=Button9
TCSCL9=LCLComboBox5
TCSCL10=Button8
TCSCL11=LCLComboBox4
TCSCL12=Button7
TCSCL13=LCLComboBox2
TCSCL14=LCLComboBox3
TCSCL15=Button3
TCSCL16=Button12
TCSCL17=Button4
TCSCL18=Button5
TCSCL19=Button6
TCSCL20=Window5
TCSCL21=Button16
TCSCL22=Button15
TCSCL23=Button13
TCSCL24=Button14

TCSCLTF1=LCLListBox1
TCSCLTF2=Button5
TCSCLTF3=Button4
TCSCLTF4=Button3
TCSCLTF5=Button2
TCSCLTF6=Button1
TCSTB1=Button10
TCSTB2=Button9
TCSTB3=Edit2
TCSTB4=ScrollBar2
TCSTB5=Edit5
TCSTB6=ScrollBar5
TCSTB7=Edit4
TCSTB8=ScrollBar4
TCSTB9=Edit3
TCSTB10=ScrollBar3
TCSTB11=Edit1
TCSTB12=ScrollBar1
TCSTB13=Button3
TCSTB14=Button5
TCSTB15=Button4
TCSTB16=Button2
TCSTB17=LCLComboBox2
TCSTB18=LCLComboBox1
TCSTB19=Button6
TCSTB20=Button14
TCSTB21=Button13
TCSTB22=Button11
TCSTB23=Button12

TCSTF1=Button5
TCSTF2=Button12
TCSTF3=Button11
TCSTF4=Button10
TCSTF5=Edit1
TCSTF6=Button9
TCSTF7=Button8
TCSTF8=TCheckBox6
TCSTF9=Button7
TCSTF10=Button6
TCSTF11=Button3
TCSTF12=Button2
TCSTF13=Button16
TCSTF14=Button15
TCSTF15=Button13
TCSTF16=Button14

TCSSC1=LCLComboBox1
TCSSC2=LCLListBox2
TCSSC3=Button2
TCSSC4=Button4
TCSSC5=Button3
TCSSC6=Button1
TCSSC7=Button8
TCSSC8=Button7
TCSSC9=Button5
TCSSC10=Button6

TCSSCSC=TCustomColumnForm
TCSSCSC1=Window2
TCSSCSC2=Edit1
TCSSCSC3=Button6
TCSSCSC4=Button9
TCSSCSC5=Button8
TCSSCSC6=Button2
TCSSCSC7=Button1
TCSSCSC8=Button5
TCSSCSC9=Button4
TCSSCSC10=Button3

TCSLG1=LCLListBox2
TCSLG2=Edit1
TCSLG3=Button4
TCSLG4=Button3
TCSLG5=Button2
TCSLG6=Button8
TCSLG7=Button7
TCSLG8=Button5
TCSLG9=Button6

TCSBO1=Button8
TCSBO2=Button7
TCSBO3=Button6
TCSBO4=Button4
TCSBO5=Button5
TCSBO6=Button3
TCSBO7=Button2
TCSBO8=Button32
TCSBO9=Button31
TCSBO28=Button30
TCSBO29=Button29
TCSBO10=Button27
TCSBO11=Button26
TCSBO12=Button16
TCSBO13=Button24
TCSBO14=Button23
TCSBO15=Button22
TCSBO16=Button21
TCSBO17=Button19
TCSBO18=Button18
TCSBO19=Button13
TCSBO20=Button14
TCSBO21=Button10
TCSBO22=Button11
TCSBO23=Button12
TCSBO24=Button36
TCSBO25=Button35
TCSBO26=Button33
TCSBO27=Button34

TCSEV1=Button12
TCSEV2=Button11
TCSEV3=Button10
TCSEV4=Button9
TCSEV5=Edit2
TCSEV6=Button8
TCSEV7=Button7
TCSEV8=Edit1
TCSEV9=Button4
TCSEV14=Button2
TCSEV10=Button17
TCSEV11=Button16
TCSEV12=Button14
TCSEV13=Button15

TCSEVAS=TASSOCIATEDLG
TCSEVAS1=ComboLBox1
TCSEVAS2=Edit1
TCSEVAS3=Edit2
TCSEVAS4=LCLComboBox2
TCSEVAS5=Button3
TCSEVAS6=Button5
TCSEVAS7=Button4
TCSEVAS8=Button2

TCSEVIV=TLISTCONF
TCSEVIV1=Button10
TCSEVIV2=Button9
TCSEVIV3=Button8
TCSEVIV4=Button7
TCSEVIV5=Button5
TCSEVIV6=Button4
TCSEVIV7=Button3
TCSEVIV8=Button2
TCSEVIV9=Button31
TCSEVIV10=Button30
TCSEVIV11=Button29
TCSEVIV12=Button28
TCSEVIV13=Button27
TCSEVIV14=Button26
TCSEVIV15=Edit4
TCSEVIV16=Edit3
TCSEVIV17=Edit2
TCSEVIV18=Button19
TCSEVIV19=Button16
TCSEVIV20=Button13
TCSEVIV21=Button18
TCSEVIV22=Edit1
TCSEVIV23=Button17
TCSEVIV24=Button15
TCSEVIV25=Button14
TCSEVIV26=Button12
TCSEVIV27=Button23
TCSEVIV28=Button22
TCSEVIV29=Button20

TCSOF1=Button1
TCSOF2=Button10
TCSOF3=Edit6
TCSOF4=Edit5
TCSOF5=Button9
TCSOF6=Edit4
TCSOF7=Edit3
TCSOF8=Edit1
TCSOF9=Button12
TCSOF10=Edit2
TCSOF11=Button8
TCSOF12=Button9
TCSOF13=Button6
TCSOF20=Button3
TCSOF14=Button5
TCSOF15=Button4
TCSOF16=Button18
TCSOF17=Button17
TCSOF18=Button15
TCSOF19=Button16

TCSAU1=Edit3
TCSAU2=Edit2
TCSAU3=Button7
TCSAU4=Button6
TCSAU5=Button5
TCSAU6=Button4
TCSAU7=Button3
TCSAU8=Button2
TCSAU9=Edit1
TCSAU10=Button12
TCSAU11=Button11
TCSAU12=Button9
TCSAU13=Button10

TCSFS1=Button9
TCSFS2=Button8
TCSFS3=Button7
TCSFS4=Button6
TCSFS5=Button5
TCSFS6=Button3
TCSFS7=Button2
TCSFS8=Button13
TCSFS9=Button12
TCSFS10=Button10
TCSFS11=Button11

TCSFTP1=Edit7
TCSFTP2=Edit6
TCSFTP3=LCLComboBox2
TCSFTP4=LCLComboBox1
TCSFTP5=Button10
TCSFTP6=Edit5
TCSFTP7=Button9
TCSFTP8=Button8
TCSFTP9=Button7
TCSFTP10=Button4
TCSFTP11=Edit4
TCSFTP12=Edit3
TCSFTP13=Button2
TCSFTP14=Edit1
TCSFTP15=Button6
TCSFTP16=Button5
TCSFTP17=Button3
TCSFTP18=Edit2
TCSFTP19=Button14
TCSFTP20=Button13
TCSFTP21=Button11
TCSFTP22=Button12

TCSPL1=Button2
TCSPL2=Button10
TCSPL3=Button8
TCSPL4=Button6
TCSPL5=Button4
TCSPL6=Button14
TCSPL7=Button13
TCSPL8=Button11
TCSPL9=Button12

TCSPLWCX=TASSOCIATEDLG
TCSPLWCX1=ComboLBox1
TCSPLWCX2=Edit1
TCSPLWCX3=Edit2
TCSPLWCX4=LCLComboBox2
TCSPLWCX5=Button3
TCSPLWCX6=Button5
TCSPLWCX7=Button4
TCSPLWCX8=Button2
TCSPLWFX=TFsPluginConfigForm
TCSPLWFX1=LCLListBox1
TCSPLWFX2=Button5
TCSPLWFX3=Button4
TCSPLWFX4=Button1
TCSPLWFX5=Button3
TCSPLWFX6=Button2
TCSPLWLX=TFsPluginConfigForm
TCSPLWFL1=LCLListBox1
TCSPLWFL2=ScrollBar1
TCSPLWLX3=Button5
TCSPLWLX4=Button4
TCSPLWLX5=Button1
TCSPLWLX6=Button3
TCSPLWLX7=Button2

TCSGR1=Edit8
TCSGR2=Button16
TCSGR3=Button17
TCSGR4=Button15
TCSGR5=Button14
TCSGR6=Button13
TCSGR7=Edit6
TCSGR8=Edit5
TCSGR9=Button12
TCSGR10=Button4
TCSGR11=Edit3
TCSGR12=Button5
TCSGR13=Edit4
TCSGR14=Button2
TCSGR15=Edit1
TCSGR16=Button3
TCSGR17=Edit2
TCSGR18=Button10
TCSGR19=Button7
TCSGR20=Button8
TCSGR21=Button9
TCSGR22=Button21
TCSGR23=Button20
TCSGR24=Button18
TCSGR25=Button19

TCSFR1=Button18
TCSFR2=Edit3
TCSFR3=Button17
TCSFR4=Button15
TCSFR5=Button14
TCSFR6=Button13
TCSFR7=Button12
TCSFR8=Button11
TCSFR9=Button9
TCSFR10=Button8
TCSFR11=Button7
TCSFR12=Button5
TCSFR13=Button4
TCSFR14=Button3
TCSFR15=Edit2
TCSFR16=Button2
TCSFR17=Edit1
TCSFR18=Button22
TCSFR19=Button21
TCSFR20=Button19
TCSFR21=Button20

TCSLE1=Button4
TCSLE2=Edit2
TCSLE3=Edit1
TCSLE4=Button1
TCSLE5=Button2
TCSLE6=Button3
TCSLE7=Button8
TCSLE8=Button7
TCSLE9=Button5
TCSLE10=Button6

TCSAZ1=Button20
TCSAZ2=Edit5
TCSAZ3=Button17
TCSAZ4=Button16
TCSAZ5=Button15
TCSAZ6=Edit4
TCSAZ7=Button13
TCSAZ8=Button12
TCSAZ9=Edit3
TCSAZ10=Button10
TCSAZ11=Button9
TCSAZ12=Edit2
TCSAZ13=Button7
TCSAZ14=Edit1
TCSAZ15=Button5
TCSAZ16=Button4
TCSAZ17=Button2
TCSAZ18=Button19
TCSAZ19=Button24
TCSAZ20=Button23
TCSAZ21=Button21
TCSAZ22=Button22

TCSZP1=Edit4
TCSZP2=Button19
TCSZP3=Button18
TCSZP4=Button17
TCSZP5=Edit3
TCSZP6=Button16
TCSZP7=Button15
TCSZP8=Button13
TCSZP9=Button12
TCSZP10=Button11
TCSZP11=Button10
TCSZP12=Edit2
TCSZP13=ScrollBar1
TCSZP14=Button8
TCSZP15=Button7
TCSZP16=Edit1
TCSZP17=Button5
TCSZP18=Button4
TCSZP19=Button3
TCSZP20=Button2
TCSZP21=LCLComboBox1
TCSZP22=Button23
TCSZP23=Button22
TCSZP24=Button20
TCSZP25=Button21

TCSMC1=Button15
TCSMC2=Button19
TCSMC3=Button18
TCSMC4=Button17
TCSMC5=Button16
TCSMC6=Button8
TCSMC7=Button5
TCSMC8=Button13
TCSMC9=Button12
TCSMC10=Button11
TCSMC11=TCheckBox6
TCSMC12=LCLComboBox2
TCSMC13=Button7
TCSMC14=Edit2
TCSMC15=Edit3
TCSMC16=Button9
TCSMC17=Button10
TCSMC18=Button3
TCSMC19=Button2
TCSMC20=Edit1
TCSMC21=Button23
TCSMC22=Button22
TCSMC23=Button20
TCSMC24=Button21

TCTEAMSEL=TCmdSelForm
TCTEAMSEL1=LCLListBox2
TCTEAMSEL2=LCLListBox1
TCTEAMSEL3=Edit1
TCTEAMSEL4=Button2
TCTEAMSEL5=Button1

TCTEAMSEL6=Button4
TCTEAMSEL7=Button3
TCTEAMSEL8=Button2
TCTEAMSEL9=Button1

TCTEAMNEW=TSTDTREEDLG
TCTEAMNEW1=Edit1
TCTEAMNEW2=Button4
TCTEAMNEW3=Button2
TCTEAMNEW4=Button6

TCCOPY=TInpComboDlg
TCCOPY1=Edit2
TCCOPY2=Button3
TCCOPY3=Edit1
TCCOPY4=LCLComboBox1||0||LCLComboBox2||1||Configuration||ShowCopyOptions
TCCOPY5=Button9
TCCOPY14=Button1
TCCOPY15=Button2
TCCOPY6=Button8||0||Button12||1||Configuration||ShowCopyOptions
TCCOPY7=Button3||0||Button7||1||Configuration||ShowCopyOptions
TCCOPY8=Button7||0||Button11||1||Configuration||ShowCopyOptions
TCCOPY9=Button6||0||Button10||1||Configuration||ShowCopyOptions
TCCOPY10=Button3
TCCOPY11=Button6
TCCOPY12=Button5
TCCOPY13=Button4

TCCOPYD=TInpComboDlg
TCCOPYD1=Edit2
TCCOPYD3=Edit1
TCCOPYD4=LCLComboBox1||0||LCLComboBox2||1||Configuration||ShowCopyOptions
TCCOPYD5=Button10
TCCOPYD14=Button1
TCCOPYD16=Button3
TCCOPYD15=Button2
TCCOPYD6=Button9||0||Button13||1||Configuration||ShowCopyOptions
TCCOPYD7=Button4||0||Button8||1||Configuration||ShowCopyOptions
TCCOPYD8=Button8||0||Button12||1||Configuration||ShowCopyOptions
TCCOPYD9=Button7||0||Button11||1||Configuration||ShowCopyOptions
TCCOPYD10=Button4
TCCOPYD11=Button7
TCCOPYD12=Button6
TCCOPYD13=Button5

TCCOPYFTP=TCheckEditBox
TCCOPYFTP1=Edit1
TCCOPYFTP2=Button6
TCCOPYFTP3=Button2
TCCOPYFTP4=Button1
TCCOPYFTP5=Button5
TCCOPYFTP6=Button4
TCCOPYFTP7=Button3

TCIASS=TDlgCustomColors
TCIASS1=LCLListBox1
TCIASS2=Button5
TCIASS3=Button4
TCIASS4=Button3
TCIASS5=Button2
TCIASS6=Button1

TCMASK=TCOMBOINPUT
TCMASK1=Edit1
TCMASK2=LCLComboBox1
TCMASK3=LCLListBox1
TCMASK4=Button1
TCMASK5=Button3
TCMASK6=Button2

TCETYPE=TEditTypeForm
TCETYPE1=Button11
TCETYPE2=Edit1
TCETYPE3=Button1
TCETYPE4=Edit3
TCETYPE5=Edit2
TCETYPE6=Button4
TCETYPE7=LCLListBox1
TCETYPE8=Button10
TCETYPE9=Button9
TCETYPE10=Button8
TCETYPE11=Button3
TCETYPE12=ScrollBar1
TCETYPE12=Button5
TCETYPE13=Button6
TCETYPE14=Button2

TCCICON=TChooseIcon
TCCICON1=Edit2
TCCICON2=Button3
TCCICON3=LCLListBox1
TCCICON4=Edit1
TCCICON5=Button2
TCCICON6=Button1

TCEACT=TEdActionForm
TCEACT1=Edit7
TCEACT2=Edit6
TCEACT3=Edit5
TCEACT4=Button5
TCEACT5=Button3
TCEACT6=Button2
TCEACT7=Button1

TCATTR=TATTRIBDLG
TCATTR1=Button17
TCATTR2=Button16
TCATTR3=Button15
TCATTR4=Button14
TCATTR5=Button13
TCATTR6=Button4
TCATTR7=Button3
TCATTR8=Edit2
TCATTR9=Edit1
TCATTR10=Button2
TCATTR11=Button6
TCATTR12=LCLComboBox1
TCATTR13=Window1
TCATTR14=Button8
TCATTR15=Button7
TCATTR16=Button5
TCATTR17=Button11
TCATTR18=Button10
TCATTR19=Button9
TCATTR20=LCLComboBox3
TCATTR21=LCLComboBox2
TCATTR22=Edit3
TCATTR23=Button8
TCATTR24=Button7
TCATTRD=TDateTimePickForm
TCATTRD1=SysDateTimePick32-2
TCATTRD2=SysDateTimePick32-1
TCATTRD3=msctls_updown32-1
TCATTRD4=Button2
TCATTRD5=Button1

TCATRFTP=TChmodForm
TCATRFTP1=Button18
TCATRFTP2=Button17
TCATRFTP3=Button16
TCATRFTP4=Button15
TCATRFTP5=Button13
TCATRFTP6=Button12
TCATRFTP7=Button11
TCATRFTP8=Button10
TCATRFTP9=Button8
TCATRFTP10=Button7
TCATRFTP11=Button6
TCATRFTP12=Button5
TCATRFTP13=Edit1
TCATRFTP14=Button3
TCATRFTP15=Button2
TCATRFTP16=Button1

TCCOMM=TCmtEditForm
TCCOMM1=Edit1
TCCOMM2=Button1
TCCOMM3=Button4
TCCOMM4=Button3
TCCOMM5=Button2

TCFIND=TFindFile
TCFIND1=SysTabControl32-1
TCFIND2=Edit3
TCFIND3=LCLComboBox4
TCFIND4=Edit2
TCFIND5=LCLComboBox3
TCFIND6=Button4
TCFIND7=Button17
TCFIND8=Button7
TCFIND9=Button10
TCFIND10=Button16
TCFIND11=LCLComboBox1
TCFIND12=Button15
TCFIND13=Edit1
TCFIND14=LCLComboBox2
TCFIND15=Button14
TCFIND16=Button13
TCFIND17=Button12
TCFIND18=Button11
TCFIND19=Button9
TCFIND20=Button8
TCFIND21=Button6
TCFIND22=Button5
TCFIND81=Button3
TCFIND82=Button2
TCFIND23=Button50
TCFIND24=Button49
TCFIND25=Button1

TCFIND26=Button20
TCFIND27=Edit5
TCFIND28=Button5
TCFIND29=Edit4
TCFIND30=Button4
TCFIND31=Button19
TCFIND32=Edit3
TCFIND33=ScrollBar2
TCFIND34=LCLComboBox4
TCFIND35=LCLComboBox4
TCFIND36=Button18
TCFIND37=LCLComboBox3
TCFIND38=Edit2
TCFIND39=ScrollBar1
TCFIND40=LCLComboBox2
TCFIND41=Button17
TCFIND42=Button16
TCFIND43=Button15
TCFIND44=Button14
TCFIND45=Button6
TCFIND46=Button13
TCFIND47=Button12
TCFIND48=Button7
TCFIND49=Button11
TCFIND50=Button9
TCFIND51=Button8
TCFIND52=Button10
TCFIND75=Button3
TCFIND76=Edit1
TCFIND77=LCLComboBox1
TCFIND78=Button2
TCFIND79=Button50
TCFIND80=Button49


TCFIND83=Button45
TCFIND84=Button48
TCFIND85=Button47
TCFIND86=Button46

TCFIND53=Button4
TCFIND54=Button3
TCFIND55=Button2
TCFIND56=LCLComboBox3
TCFIND57=LCLComboBox2
TCFIND58=LCLComboBox1
TCFIND59=Edit1
TCFIND60=Button6
TCFIND61=Button5
TCFIND62=LCLListBox1
TCFIND63=Window2
TCFIND64=Button4
TCFIND65=Button3
TCFIND66=Button2
TCFIND67=Button45
TCFIND68=Button48
TCFIND69=Button47
TCFIND70=Button46

TCFIND71=Button45
TCFIND72=Button48
TCFIND73=Button47
TCFIND74=Button46



TCFINDSAVE=TSTDTREEDLG
TCFINDSAVE1=Edit1
TCFINDSAVE2=Button4
TCFINDSAVE3=Button2

TCCUZBAR=TBUTTONCHANGEDLG
TCCUZBAR1=Window1
TCCUZBAR2=Button15
TCCUZBAR3=LCLListBox2
TCCUZBAR4=Button13
TCCUZBAR5=Button14
TCCUZBAR6=Edit2
TCCUZBAR7=Button3
TCCUZBAR8=Button5
TCCUZBAR9=Button4
TCCUZBAR10=Edit1
TCCUZBAR11=Edit7
TCCUZBAR12=Button1
TCCUZBAR13=Button12
TCCUZBAR14=Edit6
TCCUZBAR15=Edit5
TCCUZBAR16=Edit4
TCCUZBAR17=Button10
TCCUZBAR18=LCLListBox1
TCCUZBAR19=Edit3
TCCUZBAR20=Button11
TCCUZBAR21=Button6
TCCUZBAR22=Button9
TCCUZBAR23=Button8
TCCUZBAR24=Button7

TCONEBAR=TONEBUTTONCHANGEDLG
TCONEBAR1=Edi5
TCONEBAR2=Button1
TCONEBAR3=Button8
TCONEBAR4=Edit4
TCONEBAR5=Edit3
TCONEBAR6=Edit2
TCONEBAR7=Button6
TCONEBAR8=LCLListBox1
TCONEBAR9=Edit1
TCONEBAR10=Button7
TCONEBAR11=Button2
TCONEBAR12=Button5
TCONEBAR13=Button4
TCONEBAR14=Button3

TCCOMP=TFileCompForm
TCCOMP1=Edit2
TCCOMP2=Button16
TCCOMP3=Edit1
TCCOMP4=Button15
TCCOMP5=Button17
TCCOMP6=Button14
TCCOMP7=Button13
TCCOMP8=Button12
TCCOMP9=Button7
TCCOMP10=Button6
TCCOMP11=Button5
TCCOMP12=Button4
TCCOMP13=Button1
TCCOMP14=Button10
TCCOMP15=Button11
TCCOMP16=Button3
TCCOMP17=Button2
TCCOMP18=Button9
TCCOMP19=Button8
TCCOMP20=Window4
TCCOMP21=Window3
TCSEARCH=TSEARCHTEXT
TCSEARCH1=Edit1
TCSEARCH2=LCLComboBox1
TCSEARCH3=Button8
TCSEARCH4=Button4
TCSEARCH5=Button7
TCSEARCH6=Button3
TCSEARCH7=Button6
TCSEARCH8=Button5
TCSEARCH9=Button2

TCLABEL=TVOLLABELDLG
TCLABEL1=Edit1
TCLABEL2=Button2
TCLABEL3=Button1

TCLISTER=TLister

TCPACK=TDLGZIP
TCPACK1=Edit1
TCPACK2=Button24
TCPACK3=Button23
TCPACK4=Button22
TCPACK5=Button6
TCPACK6=Button5
TCPACK7=Button2
TCPACK25=Button1
TCPACK8=Button3
TCPACK9=Button18
TCPACK10=Button17
TCPACK11=Button16
TCPACK12=Button15
TCPACK13=Button14
TCPACK14=Button12
TCPACK15=Button10
TCPACK16=Button9
TCPACK17=Button8
TCPACK18=Button11
TCPACK19=LCLComboBox1
TCPACK20=Button13
TCPACK21=Button21
TCPACK22=Button20
TCPACK23=Button19
TCPACK24=Button4

TCPACKD=TDLG2FILEACTIONMIN
TCPACKD1=Button2
TCPACKD2=Button3
TCPACKD3=Button1

TCPACKRP=TOverWriteForm
TCPACKRP1=Button14
TCPACKRP2=Button13
TCPACKRP3=Button12
TCPACKRP4=Button11
TCPACKRP5=Button10
TCPACKRP6=Button9
TCPACKRP7=Button8
TCPACKRP8=Button7

TCDIRTR=TCHANGETREEDLG
TCDIRTR1=LCLListBox1
TCDIRTR2=Window2
TCDIRTR3=Button4
TCDIRTR4=Button3
TCDIRTR5=Button2
TCDIRTR6=Button1

TCPREVIEW=TPrintDlg
TCPREVIEW1=Window3
TCPREVIEW2=LCLComboBox5
TCPREVIEW3=Edit1
TCPREVIEW4=LCLComboBox4
TCPREVIEW5=LCLComboBox2
TCPREVIEW6=ScrollBar1
TCPREVIEW7=LCLComboBox3
TCPREVIEW8=LCLComboBox1
TCPREVIEW9=Button4
TCPREVIEW10=Button2
TCPREVIEW11=Button3
TCPREVIEW12=Button1

TCMARG=TMarginsDlg
TCMARG1=Edit6
TCMARG2=Edit4
TCMARG3=Edit2
TCMARG4=Edit5
TCMARG5=Edit3
TCMARG6=Edit1
TCMARG7=Button3
TCMARG8=Button2

TCPRINT=#32770
TCPRINT1=ComboBox1
TCPRINT2=Button2
TCPRINT3=Static3
TCPRINT4=Static5
TCPRINT5=Static7
TCPRINT6=Static9
TCPRINT7=Button3
TCPRINT8=Button5
TCPRINT9=Button6
TCPRINT10=Edit1
TCPRINT11=Edit2
TCPRINT12=Button7
TCPRINT13=Edit3
TCPRINT14=msctls_updown32-1
TCPRINT15=Button10
TCPRINT16=Button11

TCSTPRINT=#32770
TCSTPRINT1=ComboBox1
TCSTPRINT2=Button2
TCSTPRINT3=ComboBox2
TCSTPRINT4=ComboBox3
TCSTPRINT5=Button5
TCSTPRINT6=Button6
TCSTPRINT7=Button9
TCSTPRINT8=Button7
TCSTPRINT9=Button8

TCONNECT=TCONNECT
TCONNECT1=LCLListBox1
TCONNECT2=Button10
TCONNECT3=Button9
TCONNECT4=Button8
TCONNECT5=Button7
TCONNECT6=Button2
TCONNECT7=Button6
TCONNECT8=Button5
TCONNECT9=Button1
TCONNECT10=Button4
TCONNECT11=Button3

TCCONDET=TDETAILS
TCCONDET1=Edit6
TCCONDET2=Edit5
TCCONDET3=Button6
TCCONDET4=Button8
TCCONDET5=Edit4
TCCONDET6=Edit1
TCCONDET7=Button5
TCCONDET8=Edit3
TCCONDET9=Edit2
TCCONDET10=Button7
TCCONDET11=Button3
TCCONDET12=Button2
TCCONDET13=LCLComboBox1
TCCONDET14=Button1
TCCONDET15=Button4
TCCONDET16=Button14
TCCONDET17=Button13
TCCONDET18=Button12
TCCONDET19=Edit1
TCCONDET20=LCLComboBox1
TCCONDET21=Button3
TCCONDET22=Edit3
TCCONDET23=LCLComboBox3
TCCONDET24=Edit2
TCCONDET25=LCLComboBox2
TCCONDET26=Button2
TCCONDET27=Button1

TCCNDED=TSTDTREEDLG
TCCNDED1=Edit1
TCCNDED2=Button4
TCCNDED3=Button2

TCSFD=TFireWallDlg
TCSFD1=Button11
TCSFD2=Button10
TCSFD3=Button9
TCSFD4=Button8
TCSFD5=Button7
TCSFD6=Button6
TCSFD7=Button5
TCSFD8=Button4
TCSFD9=Button3
TCSFD10=Button2
TCSFD11=Edit3
TCSFD12=Edit2
TCSFD13=Edit1
TCSFD14=Button14
TCSFD15=Button13
TCSFD16=Button12

TCCNDNEW=TNewConnDlg
TCCNDNEW1=Edit1
TCCNDNEW2=LCLComboBox2
TCCNDNEW3=Button6
TCCNDNEW4=Button3
TCCNDNEW5=LCLComboBox1
TCCNDNEW6=Button1
TCCNDNEW7=Button5
TCCNDNEW8=Button4
TCCNDNEW9=Button2

TCCNDF=TSTDTREEDLG
TCCNDF1=Edit1
TCCNDF2=Button4
TCCNDF3=Button2

TCCNDEN=TExtMsgForm
TCCNDEN1=Button9
TCCNDEN2=Button8

TCCRYPT=TCryptOptions
TCCRYPT1=Button4
TCCRYPT2=Button3
TCCRYPT3=Button2
TCCRYPT4=Button5
TCCRYPT5=Button7
TCCRYPT6=Button6

TCTRNS=#32770
TCTRNS1=Button1
TCTRNS2=Button2
TCTRNS3=Button3
TCTRNS4=Button4
TCTRNS5=Edit1

TCNLD=TSTDTREEDLG
TCNLD1=Edit1
TCNLD2=Button1
TCNLD3=Button4
TCNLD4=Button2

TCFTPVIEW1=Window2
TCFTPVIEW2=LCLComboBox1
LCLListBox=1

TCNEWF=TCOMBOINPUT
TCNEWF1=Edit1
TCNEWF2=LCLComboBox1
TCNEWF3=Button3
TCNEWF4=Button2

TCRENAME=TMultiRename
TCRENAME1=Edit6
TCRENAME2=LCLComboBox6
TCRENAME3=Button16
TCRENAME4=Edit5
TCRENAME5=Button15
TCRENAME6=Edit1
TCRENAME7=LCLComboBox3
TCRENAME8=Edit2
TCRENAME9=LCLComboBox4
TCRENAME10=Button11
TCRENAME11=Button10
TCRENAME12=Button9
TCRENAME13=Button13
TCRENAME14=Button12
TCRENAME15=LCLComboBox2
TCRENAME16=Button5
TCRENAME17=Button6
TCRENAME18=Edit4
TCRENAME19=ScrollBar2
TCRENAME20=Edit3
TCRENAME21=ScrollBar1
TCRENAME22=LCLComboBox5
TCRENAME23=LCLComboBox1
TCRENAME24=Window3
TCRENAME25=LCLListBox1
TCRENAME26=Button4
TCRENAME27=Button2
TCRENAME28=Button1
TCRENAME29=Button3

TCDRIVE=TDriveSelBox
TCDRIVE1=LCLListBox1
TCDRIVE2=Button3
TCDRIVE3=Button2
TCDRIVE4=Button1

TCUNPACK=TDLGUNZIPALL
TCUNPACK1=Edit2
TCUNPACK2=Edit1
TCUNPACK3=LCLComboBox1
TCUNPACK4=Button7
TCUNPACK5=Button6
TCUNPACK6=Button1
TCUNPACK7=Button5
TCUNPACK8=Button4
TCUNPACK9=Button3
TCUNPACK10=Button2

TCUNZPACK=TDLGUNZIP
TCUNZPACK1=Edit1
TCUNZPACK2=Button6
TCUNZPACK3=Button5
TCUNZPACK4=Button4
TCUNZPACK5=Button3
TCUNZPACK6=Button2
TCUNZPACK7=Button1

TCMARK=TCOMBOINPUT
TCMARK1=Edit1
TCMARK2=LCLComboBox1
TCMARK3=LCLListBox1
TCMARK4=Button1
TCMARK5=Button3
TCMARK6=Button2

TCFILTER=TCOMBOINPUT
TCFILTER1=Edit1
TCFILTER2=LCLComboBox1
TCFILTER3=LCLListBox1
TCFILTER4=Button1
TCFILTER5=Button3
TCFILTER6=Button2

TCUMENU=TUSERMENUCHANGE
TCUMENU1=LCLListBox1
TCUMENU2=Edit3
TCUMENU3=Button1
TCUMENU4=Button4
TAltEdit2=Edit2
TAltEdit3=Edit1
TAltEdit4=LCLComboBox1
TAltEdit5=Button3
TAltEdit6=Button2
TAltEdit7=Button11
TAltEdit8=Button10
TAltEdit9=Button9
TAltEdit10=Button8
TAltEdit11=Button7
TAltEdit12=Button6
TAltEdit13=Button5

TCEDIT=TCheckEditBox
TCEDIT1=Edit1
TCEDIT2=Button5
TCEDIT3=Button4
TCEDIT4=Button3